[
    {
        "comment_id": "kzrmwtp",
        "author": "whoknowshank",
        "score": 158,
        "text": "Nothing like being ghosted after an interview… so rude. Glad you got a good offer and are on your way!",
        "replies": [
            {
                "comment_id": "kzrn8eg",
                "author": "staysharp87",
                "score": 42,
                "text": "Thank you so much! Yeah I was surprised with that one. The interview was super pleasant and favorable too! So I thought I nailed that one. But oh well... maybe it's for the better.",
                "replies": [
                    {
                        "comment_id": "kzs050u",
                        "author": "Yao-zhi",
                        "score": 13,
                        "text": "I'm sorry I'm sure it really hurt. But congrats now!",
                        "replies": [
                            {
                                "comment_id": "kzs1h9p",
                                "author": "staysharp87",
                                "score": 8,
                                "text": "It did (and it still does to some degree). But you know what they say, no pain no gain. Thanks for the congrats!",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzrq2t6",
        "author": "booklover333",
        "score": 108,
        "text": "Even though industry makes up 30% of your applications, it provided 100% of your offers. Faculty positions are truly impossible to crack at this point...",
        "replies": [
            {
                "comment_id": "kzs2ai6",
                "author": "Frari",
                "score": 32,
                "text": "> Faculty positions are truly impossible to crack at this point...\n\nPostgrad students are sold a lie if they are looking to get a faculty position. Chances are very slim, almost on the level as succeeding as a professional sports player.  I always try and tell my students the truth of their chances, luckily most want to get into medicine anyway.",
                "replies": [
                    {
                        "comment_id": "kztrtks",
                        "author": "nonosci",
                        "score": 5,
                        "text": "Honestly for many international students it's a conduit to a green card. ",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzs1o67",
        "author": "Frari",
        "score": 41,
        "text": "Speaking as someone in academia \n\nindustry job >>> professor\n\ncongrats",
        "replies": [
            {
                "comment_id": "kzs2vgd",
                "author": "staysharp87",
                "score": 6,
                "text": "Thank you so much for the congrats! And whether you mean it or you're just saying to make me feel better, you made me feel good about my choice (although, technically I did not have a choice to begin with). I really appreciate your kind words.",
                "replies": [
                    {
                        "comment_id": "l01ljh9",
                        "author": "BicyclingBiochemist",
                        "score": 2,
                        "text": "Better pay, better working conditions, they aren't saying it to be nice. Dreams of professorship (which often payscale wise ain't better than industry) are sold to keep postdocs being underpaid and propping up the flawed industry. Congratulations on getting out and securing a good job.",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzsaepp",
        "author": "Histidine",
        "score": 19,
        "text": ">It's a big company with (relatively) stable jobs so hopefully I won't have to worry about layoffs for some time. The employee retention is longer than other companies of its size and I've heard good things about the culture of the company as well. So I'm very optimistic.\n\nI've been in industry for more than a decade now and thankfully never laid off from a job, but it does happen a lot even at \"stable\" companies.  For most places it's a 2-3 year cycle of slow expansion followed by hiring freezes and layoffs.  Not to scare you off, but it's an important lesson to learn early on.\n\nThat said, industry can be an amazing place as long as you are working with good people.  Hopefully you found a good group!",
        "replies": [
            {
                "comment_id": "kzsb7d1",
                "author": "staysharp87",
                "score": 4,
                "text": "Thank you for the insight! Yes I am aware of the potential risk that is the layoffs, and I'll keep an eye out for other opportunities in case that happens. Having said that, I do have a reason to believe that the group that I'll be part of will be safe for some time (I won't get into any details).\n\nFrom what I gathered from the multiple rounds of interviews, I like the team members already. Hopefully my feelings are correct and the group is indeed awesome.\n\nEdit: nice username btw!",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzruh5q",
        "author": "rietveldrefinement",
        "score": 23,
        "text": "Can I ask how did you manage 113 applications for faculty positions…? I went for 10 this year but I'm already using up all of my vacation times and kinda like slacking on my current work …..\n\nBig congrats!!'",
        "replies": [
            {
                "comment_id": "kzruyhe",
                "author": "staysharp87",
                "score": 15,
                "text": "I went in like a mad man. Because I *really* wanted this to happen.",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzrwpgc",
        "author": "Azylim",
        "score": 10,
        "text": "heyyy kanpai.\n\nGo do some excellent science for us",
        "replies": [
            {
                "comment_id": "kzryxby",
                "author": "staysharp87",
                "score": 6,
                "text": "Cheers! I'll do my best",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzrvkvg",
        "author": "SuperbSpider",
        "score": 10,
        "text": "Congratulations! ",
        "replies": [
            {
                "comment_id": "kzrvum2",
                "author": "staysharp87",
                "score": 3,
                "text": "Thank you! I thought this moment would never come, yet here I am :')",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzt74nc",
        "author": "AvatarIII",
        "score": 13,
        "text": "3 interviews out of 163 applications seems low, but 2 offers out of 3 interviews is pretty good! good going!",
        "replies": []
    },
    {
        "comment_id": "kzt6npo",
        "author": "StabithaStevens",
        "score": 3,
        "text": "YES!!  Congratulations and best of luck in your new career.",
        "replies": []
    },
    {
        "comment_id": "kzte5m1",
        "author": "neuroray",
        "score": 2,
        "text": "Can you give some tips of how to skip academia? (What did you put in your CV and this kind of things?)",
        "replies": [
            {
                "comment_id": "kztiw44",
                "author": "staysharp87",
                "score": 3,
                "text": "I don't get what you mean by \"skip\" academia. I very well went through what all the academia has to offer (BS/MS/PhD/Postdoc). If anything, what I did was opposite of skipping academia.\n\nAs far as CV/resume goes, there's not much you can do about CV, since CV is basically \\*everything\\* you've done so far. Academia usually ask for CV.\n\nResume on the other hand, is very customizable. Resume is basically a highlight of CV. Industry usually ask for resume (although I submitted both CV and resume when applying anyway for the most part). I put my education, experience, select publications, select awards and honors, and skills. You can definitely change out words and expressions to best meet the job description. The emphasis of the resume for me was the experience part. And the skill section was where I did the most customizing to fit the job description. Out of the skill sets I have, I put the skill sets the employer was looking for (did not lie, I just selected from my existing skill set). Resume is usually 1\\~2 pages, but I kept it down to 1 page for simplicity of viewing, so it was a heck of a task trying to condense what I wanted to emphasize without shrinking the text size too much (I used 11pt, with narrow margin).",
                "replies": [
                    {
                        "comment_id": "kztswjw",
                        "author": "nonosci",
                        "score": 2,
                        "text": "I'm impressed with the 1 page. I've tried my hardest, my structure is \n\n\nprofessional statement (4 sentences)\nSkills (8 in 2 columns of 4)\nexperience 3 jobs (2 postdoc+ grad school)\neducation (BSc MSc PhD)\n\n\nCondensed as much as possible still 2 pages though.\n\n\nAny tips on paring it down?",
                        "replies": [
                            {
                                "comment_id": "kztwnwo",
                                "author": "staysharp87",
                                "score": 3,
                                "text": "Maybe you just have more experience than I do so you have more to talk about. \n\nFor me, I did not have a professional statement. Instead, I integrated that into the \"experience\" section (whether that was a good idea or not). But I did include the professional statement in my CV, which I submitted along with my resume. \n\nFor skills (and awards & honor section), I did not use columns nor line breaks. I just wrote them out in one single string of words. Breaking them up by commas or using bold texts for better separation between items. I've seen people do this and it saved me a ton of space. \n\nFor publications, I only had my first author papers, so I was able to get away with [my name] et al. \"Title\" *journal* (year). Without having to write out a full citation.",
                                "replies": []
                            },
                            {
                                "comment_id": "kzx6kgy",
                                "author": "mineCutrone",
                                "score": 2,
                                "text": "I suggest not doing multiple columns since this can mess up automated resume screening. Most positions dont require a plethora of skills. You are better off having your work experiences and incorporating only the skills in job listing used for impactful research.    \n\nI see resumes all the time here listing python or R in their skills but their work experience doesnt mention them at all. Makes zero sense how someone can be proficient in those languages but never use it in their research experiences. It would be a major red flag to me that the person is embellishing or even flat out lying",
                                "replies": [
                                    {
                                        "comment_id": "kzxejbb",
                                        "author": "nonosci",
                                        "score": 1,
                                        "text": "That makes sense, I didn't think of the non-human aspect. I'm always curious if this new age of recruitment add any value to industries or if it's another vague grey box that everyone uses because everyone does it.",
                                        "replies": []
                                    },
                                    {
                                        "comment_id": "l04egpl",
                                        "author": "Erdbeer_Milch",
                                        "score": 1,
                                        "text": "I have listed Python and R on my CV. I learned from university classes and through a 9 month long internship (I did 7 different internships during university to figure out what I like). Both is not listed on my CV since I do not list all classes I attended and no internships just real jobs. I also do coding for fun in my free time and I also do not write down my hobbies at my CV. So it's not lying but I also have no 'real' work experience. But now I am scared that people see this as a red flag. Would you recommend to take out the coding experience from my CV?",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "l07l96f",
        "author": "quickbrownfox_",
        "score": 2,
        "text": "These kind of posts making me so fucking happy. Congratulations!",
        "replies": []
    },
    {
        "comment_id": "kzuu1e5",
        "author": "EmanRapp",
        "score": 2,
        "text": "Can I ask a few questions:\n1. Since you also looked for faculty positions, I assume you also completed a postdoc?\n2. How many first author papers do you have and what was their impact factor?\n3. What rank was the school you got a PhD from?\n4. How much is your new job paying you and what state is it in?\n\nIf it's too personal I understand, just trying to assess my own future prospects.",
        "replies": [
            {
                "comment_id": "kzzd9m9",
                "author": "staysharp87",
                "score": 2,
                "text": "I'm going to make my answer very broad. I hope you understand. \n\n1. Yes, I'm a postdoc right now.\n\n2. 3, all IF>10 (2 more in preparation) \n\n3. Top 20 in US in engineering (doing postdoc in one of top 3 in US in engineering) \n\n4. 120k~150k base. CA",
                "replies": [
                    {
                        "comment_id": "kzzhcwe",
                        "author": "EmanRapp",
                        "score": 2,
                        "text": "I truly appreciate your reply, this is very helpful information! Your qualifications are STACKED tbh. You're gonna do great in your new job, wishing you the best!",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzzsqo7",
        "author": "21Noodle",
        "score": 1,
        "text": "Amazing! Sorry that you had such a terrible struggle, but congrats on pushing through and having such success! 🙌🏻\nAll the best!",
        "replies": []
    },
    {
        "comment_id": "l035l1i",
        "author": "LucidGoonlad",
        "score": 1,
        "text": "Excellent work sir, leg it from academia. \n\nHad a similar experience, only one of my mates is still grinding through, the rest of us are in industry.\n\nTiny percentage get to professor, the rest are lab monkeys/grant grubbers.\n\nBetter pay and more prospects.\n\nCrack on mate 👏",
        "replies": []
    },
    {
        "comment_id": "kzvx5fu",
        "author": "Creative-Sea955",
        "score": 1,
        "text": "If you are seeking a faculty position with a research focus, demonstrating prior grant success is essential. Otherwise, competing with the numerous K99 awardees can be challenging, as NIH is currently awarding a lot of K99 grants.",
        "replies": []
    },
    {
        "comment_id": "kzvj5v2",
        "author": "Worth-Banana7096",
        "score": 0,
        "text": "\"After 8 months of agonizing job-hunting, I'm finally done!\"\n\n\"Where did you get hired?\"\n\n\"Huh? No, I just gave up.\"",
        "replies": []
    }
]