[
    {
        "comment_id": "l064guf",
        "author": "Inevitable-Copy3619",
        "score": 2,
        "text": "I'm a linguist. I fall more into what Gibson called Constructionism. He didn't quite say it but the idea is that language is stored and recalled as chunks rather than individual words. So for example \"salt\" is a word and \"pepper\" is a word. But that fact that we almost all always say \"salt and pepper\" indicates that we store one chunk \"salt and pepper\" rather than three words being pulled up. In fact psycholinguistic tests show that other brain more or less skips a beat when it hears \"pepper and salt\", indicating that there is one process for processing \"salt and pepper\" as a common chunk, and a separate process for processing \"pepper and salt\" as individual items maybe. \n\nHow does this play into your question?  The brain is simply looking for the simplest ways to produce thoughts and recall information. A \"balloon\" is a thing that can stand on its own: \"go get the balloon\"…which balloon \"the red one\". Red cannot stand on its own. Turns out the brain likes subdividing and only really using the simplest subsets. We may even distinguish between \"big red balloons\" vs \"small red balloons\". The adjectives allow us to store a simple form \"balloon\" and modify in the simplest ways. We don't need separate lexical items for \"balloon\" , \"big balloon\" , \"red balloon\" and \"big red balloon\". Does that make sense?  They have separate functions but ultimately it saves processing power by being able to subdivide and specify but only specify as much as needed. I wouldn't say \"big red balloon\" if all the balloons were of the same size, or color.  I only need that construction if color AND size vary. So ultimately the adjectives and nouns specify but in quite different ways.",
        "replies": [
            {
                "comment_id": "l065jwq",
                "author": "Inevitable-Copy3619",
                "score": 1,
                "text": "Oh and strict parts of speech only exist in text books. Nominilizarion (making something a noun) is super common for adjectives. We can say \"the poor\" in a political speech and mean \"the poor who don't make above the federal poverty income\". It's a shorthand. Our brains are really good at extrapolating the whole meaning. So in that case \"poor\" essentially becomes a noun. So it's no longer serving its standard purpose of modifying. The modifier has become the thing. This gets into the idea of semantics and meaning which is fascinating. Ultimately words don't matter, meaning is the goal and we can really manipulate language and to creat clear, concise meaning that is least taxing on the brain. \n\nGibson talks a lot about embedded clauses and distant dependencies. That's why those just don't work in natural language. The meaning is too taxing on the brain, and there are far too many points were the wrong meaning can be introduced.",
                "replies": []
            }
        ]
    }
]