[
    {
        "comment_id": "kzfvchh",
        "author": "Psykalima",
        "score": 26,
        "text": "A fun/calm, Heartfelt conversation is appreciated right now.\n\nThank you once again, Lex 🤍",
        "replies": [
            {
                "comment_id": "kzjsi5t",
                "author": "SDSunDiego",
                "score": 6,
                "text": "I like when I cannot tell when Lex is trying to say something funny and then realize he said something funny. Good humor in the beginning.",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzfzrj2",
        "author": "lexlibrary",
        "score": 20,
        "text": "Books mentioned in this episode:\n&nbsp;\n\n* All Gas, No Brakes: A Hitchhiker's Diary by Andrew Callaghan\n* Siddhartha by Hermann Hesse\n* The Great Shark Hunt: Strange Tales from a Strange Time by Hunter S. Thompson\n* Vagabonding in Europe and North Africa by Ed Buryn\n* On the Road by Jack Kerouac\n&nbsp;\n\n[https://lexlib.io/425-andrew-callaghan/](https://lexlib.io/425-andrew-callaghan/)",
        "replies": []
    },
    {
        "comment_id": "kzf7ceq",
        "author": "adachisanchez",
        "score": 42,
        "text": "Channel 5 is the best type of journalism, the kind that causes actual positive change in the communities they are reporting on. I never go into any of Andrew & co videos and not learn something I didn't know. A unique perspective of the world, reality without the pretention to just make viral content, but because we actually have to care.",
        "replies": []
    },
    {
        "comment_id": "kzftt7d",
        "author": "BeefStrokinOff",
        "score": 13,
        "text": "Hell yes! Thank you, u/lexfridman",
        "replies": []
    },
    {
        "comment_id": "kzmvw0n",
        "author": "BigShoots",
        "score": 8,
        "text": "This kid is fascinating and in a fascinating spot in the world right now and I feel like he's just getting started. \n\nI'm not even quite halfway through the video and it's already the best interview I've seen with him. I'm slightly surprised by it but he and Lex seem to have phenomenal chemistry and you might not think so but they have a lot in common. \n\nThe Channel 5 video on the Vegas tunnels is absolutely a must-watch. He's doing really, really good work and I'm so glad he's out there doing this shit. Almost no one else is.",
        "replies": [
            {
                "comment_id": "kzpgtmm",
                "author": "oil1lio",
                "score": 2,
                "text": "It seems like Andrew is just getting started. I have a feeling that Andrew is going to go on to have a super long and prosperous career (more so than he already has)",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzez2rx",
        "author": "Thepilli17",
        "score": 12,
        "text": "Well, you can't spell Andrew, without a massive W!",
        "replies": []
    },
    {
        "comment_id": "kzgv0lb",
        "author": "gatovato23",
        "score": 8,
        "text": "I would have listened to Andrew explain Drill Music to Lex for an additional hour.",
        "replies": []
    },
    {
        "comment_id": "kzg7nva",
        "author": "TheAceOfHearts",
        "score": 3,
        "text": "At the end of the podcast Andrew asks Lex about aliens and Lex responds that he thinks we've been visited by them. Aliens confirmed! 👽",
        "replies": []
    },
    {
        "comment_id": "kzian06",
        "author": "Lazy_Scholar9427",
        "score": 3,
        "text": "I love how humble Lex and Andrew are. I laughed hard when Lex said something like you were playing chess when I was playing checkers when they talked about suits",
        "replies": []
    },
    {
        "comment_id": "kzhz5xc",
        "author": "Darkstar197",
        "score": 5,
        "text": "Living with his visual condition sounds both awesome and terrifying at the same time.",
        "replies": [
            {
                "comment_id": "l04gsba",
                "author": "RETVRN_II_SENDER",
                "score": 2,
                "text": "You get used to it, but I'm not sure how intense Andrew's is compared to mine. I've had them since I was a kid but after psychs I either started noticing more or they became more intense. For me I just kind of like the shimmers and blurs that appear in my vision sometimes, they look like those optical illusion tricks to be honest.",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzi27js",
        "author": "ouillhe",
        "score": 2,
        "text": "wasn't sean connery scottish and dead at 90?",
        "replies": [
            {
                "comment_id": "kzjpso0",
                "author": "xOuster",
                "score": 3,
                "text": "I guess that's the joke, Alex Jones is oblivious",
                "replies": [
                    {
                        "comment_id": "kzkxyq9",
                        "author": "ouillhe",
                        "score": 1,
                        "text": "ah.  i see.  lol.",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzy8zpa",
        "author": "naillesstoes",
        "score": 2,
        "text": "Phenomenal episode, I have been watching Andrew since his Quarter Confessions days and he has only gotten better at making videos. I absolutely love his interviewing style and the stories he explores are so entertaining and educational. Never knew he had HPD! So many things I never would of guessed to learn about him in this interview. I enjoyed the conversation and banter between him and Lex. Grade A jokes 10/10 episode",
        "replies": []
    },
    {
        "comment_id": "kzipboe",
        "author": "PM_ME_YOUR_PROFANITY",
        "score": 4,
        "text": "Haven't been able to watch yet, did they talk about the SA allegations against Andrew?",
        "replies": [
            {
                "comment_id": "kzjizq3",
                "author": "BraveSirOingo",
                "score": 8,
                "text": "They do, relatively in depth.",
                "replies": [
                    {
                        "comment_id": "kzl2o4w",
                        "author": "SentientLMG",
                        "score": 4,
                        "text": "Honestly didn't expect Lex to bring it up but based on how Andrew talked about everything that happened he seems to have really learned from it and taken accountability personally which was nice to hear",
                        "replies": [
                            {
                                "comment_id": "l04qwj2",
                                "author": "xseodz",
                                "score": 1,
                                "text": "Yep, unfortunately any discussion around him is going to be tarred with people refusing to listen, refusing to accept that he's held himself accountable, and refusing to watch him explain what actually happened.\n\nYou can tell because all his content is downvoted on all the main subs, when if it was anyone else it would be top rated.",
                                "replies": [
                                    {
                                        "comment_id": "l06r52d",
                                        "author": "SentientLMG",
                                        "score": 1,
                                        "text": "I mean I do understand why people respond that way though. We have a one sided accounting of the story from Andrew and based on his telling, the actual person who felt he had been coercive didn't take things public, her friend did. I get why people might feel skeptical and that it's not so easy to trust Andrew after this or feel they should write him off entirely, especially given recent history of famous people being exposed as socially/sexually problematic. It may not be considered \"logical\" or it may be kinda unfair but at the same time, people are emotional creatures and I get why they may stick to those feelings and react negatively to a person in this situation going forward.",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzrejni",
                "author": "Singularity-42",
                "score": 2,
                "text": "Why did the internet freak out about this, on Wikipedia it just says \"trying to pressure them into having sex with him\". Keyword \"trying\". Is this so bad for a 21 year old or whatever he was at the time? I'm in my 40s but back in the day 20+ years ago we called it \"being persistent\". Maybe I'm missing something, but how is this comparable to someone like Cosby or Weinstein?",
                "replies": [
                    {
                        "comment_id": "kztuj4d",
                        "author": "biggiepants",
                        "score": 3,
                        "text": "> trying to pressure them into having sex with him\". Keyword \"trying\". Is this so bad for a 21 year old or whatever he was at the time?\n\n Yes.      \nAndrew explains stuff pretty well, actually.\n\n> how is this comparable to someone like Cosby or Weinstein?\n\nI don't think people think this. Also I have to say: a bad thing is a bad thing; and, in general: yes, perspective can seem a bit out of sight at times on the internet (but also, in general: be careful not to make perpetrators out to be victims).\n\n(Also in other [subreddits](/r/h3h3productions/comments/1c369jo/andrew_callaghan_finally_discussing_what_happened/kzexv5o/) I'm reading a lot of accusation were *not* addressed ([in the Channel 5 subreddit](/r/Channel5ive/comments/1c37342/callaghan_channel_5_gonzo_journalism_controversy/))).",
                        "replies": []
                    },
                    {
                        "comment_id": "l01j81y",
                        "author": "Askme4musicreccspls",
                        "score": 2,
                        "text": "[There were plenty of other allegations](https://www.reddit.com/r/Channel5ive/comments/1083u9v/all_andrew_callaghan_allegations_summarized/), but you wouldn' know it from this interview.",
                        "replies": [
                            {
                                "comment_id": "l01lv12",
                                "author": "Singularity-42",
                                "score": 1,
                                "text": "Yeah I looked it up and the optics are...not great.",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "comment_id": "l04h2r6",
                        "author": "RETVRN_II_SENDER",
                        "score": 1,
                        "text": "times have changed a lot in 20 years. Waring a girl down until she finally gives, especially with some sort of power dynamic involved (as it seemed like in Andrew's cases) it's quite heinous.\n\n20 years ago guys would ply a girl with drinks until she's drunk enough to go home with them. That's straight up, by the book, rape today.",
                        "replies": [
                            {
                                "comment_id": "l04mk6y",
                                "author": "gubbagubs",
                                "score": 1,
                                "text": "Kind of different note: I really think the saddest part is our society immediately banishes and shuts people down without due trial/evidence. Even saying that heats a lot of people. If you search Andrews name in reddit, you can see all the posts about this topic and the immediate switch of his fans. Before he could even address it. And the fact that the claim in itself was all about money makes it even worse. \n\nI think he left it a great way and gave great wisdom. To be careful who you interact act with. It kind of scares me that someone could not give any physical or verbal \"I don't like this\" but months after decide it was unwarranted and forceful. Idk man, nowadays I would tell my kid to find a partner and stick to relationships",
                                "replies": [
                                    {
                                        "comment_id": "l059td9",
                                        "author": "RETVRN_II_SENDER",
                                        "score": 2,
                                        "text": "idk man he openly admitted these girls would \"eventually give in to his demands\". I don't know what kind of person uses language like that to refer to consensual sex. No means no. It's really not that complicated to teach your son to not be a rapist.",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzl215b",
                "author": "ItWasIndigoVelvet",
                "score": 1,
                "text": "Yeah jump towards the end for it ",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzhgnre",
        "author": "CumSlatheredCPA",
        "score": 4,
        "text": "I'm going to start that I do enjoy Andrew and his content, but man there is something about him that just makes my bullshit meter going wild. \n\nBut I'm probably wrong and I try to not judge him based off of that.",
        "replies": [
            {
                "comment_id": "kzl1v2z",
                "author": "ItWasIndigoVelvet",
                "score": 4,
                "text": "In what way tho? ",
                "replies": []
            },
            {
                "comment_id": "kzmwh12",
                "author": "BigShoots",
                "score": 6,
                "text": "Thirded on looking for an explanation. \n\nI like to delude myself into thinking I have a really good bullshit meter and I have the exact opposite opinion of him as you do.",
                "replies": []
            },
            {
                "comment_id": "kzl3rka",
                "author": "Room480",
                "score": 1,
                "text": "Bullshit meter in what way? Cause I kinda agree",
                "replies": []
            },
            {
                "comment_id": "kzw6bsz",
                "author": "Inpsul",
                "score": 0,
                "text": "I would say he sounds overly self-assured in a rehearsed way that is off-putting. Obviously he couldn't have rehearsed the whole interview, but he acts mechanical in a way that seams geared to gain someone's trust with malicious intent. This is opposed to Lex who acts mechanical with no discernible goal. \n\nI know nothing about him as a person and he is probably a great guy. I am only trying to verbalize the \"vibe\" I got because your comment made me think on this. I actually watched many of his videos and quite enjoyed them. However, I do get this odd feeling when he speaks for too long.",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzkuezs",
        "author": "leunam37s",
        "score": 1,
        "text": "In the description on spotify it says they talk about \"Phish heads\" but I didn't here it. Anyone else notice this?",
        "replies": [
            {
                "comment_id": "kzy8kaq",
                "author": "naillesstoes",
                "score": 2,
                "text": "I think it was just in reference to a video Andrew did at a phish concert, they didn't have an extensive conversation about it though briefly mentioned in the beginning",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzf1e3x",
        "author": "None",
        "score": 0,
        "text": "[deleted]",
        "replies": []
    }
]