[
    {
        "comment_id": "kzeahj1",
        "author": "chase1635321",
        "score": 39,
        "text": "I'd be interested in hearing Mouin and Morris speak. I think that conversation would be a lot more productive.",
        "replies": [
            {
                "comment_id": "kzgq6n4",
                "author": "LumberJack732",
                "score": 7,
                "text": "I had never heard of Rabbani I thought his voice was incredibly important in that debate.",
                "replies": []
            },
            {
                "comment_id": "kzg0z8a",
                "author": "FafoLaw",
                "score": 6,
                "text": "I second this.",
                "replies": []
            },
            {
                "comment_id": "kzmw135",
                "author": "AntonioLeeuwenhoek",
                "score": 2,
                "text": "I would love that as well",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzf1352",
        "author": "None",
        "score": 53,
        "text": "[removed]",
        "replies": [
            {
                "comment_id": "kzhsmyu",
                "author": "the-jakester79",
                "score": -5,
                "text": "Both finklstein and destiny where kinda embarrassing",
                "replies": []
            },
            {
                "comment_id": "kzhpb7b",
                "author": "MembershipSolid2909",
                "score": -22,
                "text": "Go back to r/Destiny and stop ruining this subreddit",
                "replies": [
                    {
                        "comment_id": "kzhq0m6",
                        "author": "AskProud366",
                        "score": 11,
                        "text": "lol not this time buddy",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzearnu",
        "author": "An1meK1ng",
        "score": 88,
        "text": "everyone was fine except Finkelstein. if you cant see that you are already gone",
        "replies": [
            {
                "comment_id": "kzyahyk",
                "author": "Israelite123",
                "score": 1,
                "text": "agreed. this thread relized as did most rational viewers that the Palestine side did not do well in the debate and the comments showed that",
                "replies": []
            },
            {
                "comment_id": "kzefkpa",
                "author": "None",
                "score": -6,
                "text": "[deleted]",
                "replies": [
                    {
                        "comment_id": "kzek90l",
                        "author": "thatsassaultbrother",
                        "score": 10,
                        "text": "You're referring to something not even in the debate Lex hosted. Destiny only barely attacked Finkelstein after Finkelstein attacked Destiny for hours in the beginning.",
                        "replies": [
                            {
                                "comment_id": "kzeohue",
                                "author": "None",
                                "score": -1,
                                "text": "[deleted]",
                                "replies": [
                                    {
                                        "comment_id": "kzepr76",
                                        "author": "Vinnie87",
                                        "score": 5,
                                        "text": "If he doesn't belong then just destroy him with facts, Finkelstein has been studying this for decades, there's no reason he should have had to resort to ad homs. It would have looked sooo much better if he just destroyed him on facts rather than attacking him. Finkelstein was unhinged.",
                                        "replies": [
                                            {
                                                "comment_id": "kzeql53",
                                                "author": "None",
                                                "score": 0,
                                                "text": "[deleted]",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzer1nz",
                                                        "author": "Vinnie87",
                                                        "score": 5,
                                                        "text": "Because when I judge how a debate went, I look to the comments... Of clips...\n\nJesus Christ",
                                                        "replies": [
                                                            {
                                                                "comment_id": "kzervv1",
                                                                "author": "None",
                                                                "score": 1,
                                                                "text": "[deleted]",
                                                                "replies": [
                                                                    {
                                                                        "comment_id": "kzescm3",
                                                                        "author": "Vinnie87",
                                                                        "score": 3,
                                                                        "text": "\"I don't judge off of comments, but if you look at the comments he obviously lost\"",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "comment_id": "kzeqfw8",
                        "author": "Black_Mamba823",
                        "score": 6,
                        "text": "Finklestien started with the name calling. I don't think he made one acedemically point for a chunk of 2 hours all he did was call destiny an idiot refuse to elaborate",
                        "replies": []
                    },
                    {
                        "comment_id": "kzeg04s",
                        "author": "An1meK1ng",
                        "score": 3,
                        "text": "threw rocks oh my how sweet",
                        "replies": [
                            {
                                "comment_id": "kzeg5k0",
                                "author": "None",
                                "score": 4,
                                "text": "[deleted]",
                                "replies": [
                                    {
                                        "comment_id": "kzegh8a",
                                        "author": "An1meK1ng",
                                        "score": -3,
                                        "text": "which incident? send me a new article about it",
                                        "replies": [
                                            {
                                                "comment_id": "kzel7vs",
                                                "author": "None",
                                                "score": 1,
                                                "text": "[deleted]",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzemz7o",
                                                        "author": "An1meK1ng",
                                                        "score": 0,
                                                        "text": "just send me a article. i cant watch 2 hrs",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzeivhp",
                "author": "Jimger_1983",
                "score": -20,
                "text": "Finkelstein is a bull in a China closet on this topic. If you're going to have him in a debate you need an equally strong person on the other side and they simply didn't.",
                "replies": [
                    {
                        "comment_id": "kzfitzg",
                        "author": "BoofPackJones",
                        "score": 18,
                        "text": "You call finkles performance strong? They need some other screecher to counter him?",
                        "replies": [
                            {
                                "comment_id": "kzhphrf",
                                "author": "MembershipSolid2909",
                                "score": -5,
                                "text": "No. Just somebody qualified. Destiny is not that person.",
                                "replies": [
                                    {
                                        "comment_id": "l05vf9c",
                                        "author": "frostymugson",
                                        "score": 1,
                                        "text": "Except Finkelstein never countered a single point Destiny made just changed the subject while insulting him.",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "comment_id": "kzg2nz3",
                        "author": "FafoLaw",
                        "score": 13,
                        "text": "Benny Morris was there, a serious historian that everyone from both sides uses as a source, Finkelstein uses quotes from Morris's books all the time, and as was demonstrated in the debate, he takes them out of context.",
                        "replies": []
                    },
                    {
                        "comment_id": "kzggicb",
                        "author": "mossbasin",
                        "score": 5,
                        "text": "Most bulls move faster than 0.5 mph",
                        "replies": []
                    },
                    {
                        "comment_id": "kzjudd4",
                        "author": "Cyclical_Zeitgeist",
                        "score": 3,
                        "text": "Lol strong he's supposed to be the foremost experts on Palestine I walked away wondering if he even had a PHD at all with the amount of ad hominum attacks\n\nI guess it's strong if you think name calling wins adult debates lol",
                        "replies": []
                    },
                    {
                        "comment_id": "kzpggp5",
                        "author": "Fair-Description-711",
                        "score": 1,
                        "text": "Let me respond to you in the way you apparently find compelling:\n\nMr. Jimjam, with all due respect, which is none, you are a fantastic moron. Your choice of metaphors is as subtle as a sledgehammer, and your understanding of the situation rivals that of a soap dish.",
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "kzeelij",
                "author": "Chinesesingertrap",
                "score": -19,
                "text": "Says the destiny fanboy it was a seriously lopsided debate and destiny did the Israel side no favors by being there.  Finklestein while using ad hominems when he should not of was still much more prepared and knowledgeable on the topic then destiny was",
                "replies": [
                    {
                        "comment_id": "kzf17u4",
                        "author": "An1meK1ng",
                        "score": 24,
                        "text": "Maybe he should have shown that knowledge instead of crying adhoms. If anything I was overestimating finklestink knowledge before the debate. All he did was quoting other people and avoiding questions from destiny.",
                        "replies": [
                            {
                                "comment_id": "kzf1mdu",
                                "author": "Chinesesingertrap",
                                "score": -2,
                                "text": "Says the person using adhoms against finklestein here lol.  AndQuoting other scholars is knowledge and a valid tactic to use in a debate he didn't even need an iPad to do so like destiny.  If he had used his knowledge without the ad hominems he would have been the perfect foil to destiny at least but all the dggers can do is whine about adhoms as a way to deflect the fact that destiny was embarrassed in front of everyone in that debate",
                                "replies": [
                                    {
                                        "comment_id": "kzihusk",
                                        "author": "NugKnights",
                                        "score": 3,
                                        "text": "You have yet to point out a single historical inaccuracy brought up by destiny.",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzeg7ph",
                "author": "bootypoppinnostoppin",
                "score": -27,
                "text": "If youre pro israel maybe that is a pov, but destiny was the only one in the debate who isnt actually knowledgeable. Everything he knows is from wikipedia and googling shit over the last 6 months. That in no way makes him qualified to talk to Finklestien who has spent his whole life studying the topic.",
                "replies": [
                    {
                        "comment_id": "kzev142",
                        "author": "caraissohot",
                        "score": 26,
                        "text": "Then it should have been extremely easy for Finkelstein to give evidence-based examples of his lack of knowledge.\n\n\n\n\n\n\nIs Destiny qualified? I'm not sure. But Finklestein is 100% unqualified.",
                        "replies": [
                            {
                                "comment_id": "kzew0vq",
                                "author": "bootypoppinnostoppin",
                                "score": -19,
                                "text": "Did you even watch the debate? He literally gives example after example and destiny defense was always something along the lines of well the kids were terrorists. If youre justifying killing children youre on the wrong side.\n\nFound one example [https://twitter.com/zei\\_squirrel/status/1768568692277661734](https://twitter.com/zei_squirrel/status/1768568692277661734)\n\nDestiny also literally said he didnt think Israel nuking the gaza strip was genocide.\n\nTo the destiny fans responding, the act of nuking a country may not be intentional genocide. The act of nuking a populatation of 2 million mostly civilians that you have confined a strip of land that is only a couple miles long is absolutely genocide, ESPECIALLY if you are the one controlling the border.",
                                "replies": [
                                    {
                                        "comment_id": "kzf2vlc",
                                        "author": "An1meK1ng",
                                        "score": 18,
                                        "text": "Wow actual dumbfuck. Destiny was using the nuke example to that\n\nLot of people dying != Genocide \n\nThere could be some crazy scenario where even using a nuke wouldn't count as genocide. Maybe keep up with the convo next time.",
                                        "replies": [
                                            {
                                                "comment_id": "kzf4cl8",
                                                "author": "bootypoppinnostoppin",
                                                "score": -5,
                                                "text": "Confining 2 million people to a couple mile strip of land and then nuking them into oblivion is most certainly genocide. That is the part that makes it genocide, the fact that they cant leave as Israel controls their utlities and access in and out of the land. There's nothing to keep up with you are lagging so far behind in understanding its like I am talking to a toddler.",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "comment_id": "kzf2929",
                                        "author": "An1meK1ng",
                                        "score": 12,
                                        "text": "Where in the clip did Finkelstein refute him? Crying filled with journalist doesn't negate his points.",
                                        "replies": [
                                            {
                                                "comment_id": "kzf3ye6",
                                                "author": "bootypoppinnostoppin",
                                                "score": 0,
                                                "text": "You dont, and cant refute every absolute lie that a person claims in a debate, it would make for endless fact checking, and in the thread theres literally an article showing that Destinys point was completely bogus. Again why are you justifying the killing of four children? Also he does at least partially attempt to refute it by saying they came from a fishing hut.",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzpwekt",
                                                        "author": "Alternative-Song3901",
                                                        "score": 2,
                                                        "text": "He's not asking for every refutation, just one. Literally just one.",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "comment_id": "kzfsnp3",
                                        "author": "BuyTheDip96",
                                        "score": 9,
                                        "text": "I just don't understand how you can think that at all. You found one \"example\" that actually goes against your point. Yet you say finklestein gives \"example after example.\"  \n\nIt's a fact that norm didn't engage in good faith at all. It's one thing if you agree with his rhetoric, that's fine, but you're just making untrue statements with no real backup.",
                                        "replies": [
                                            {
                                                "comment_id": "kzg15kz",
                                                "author": "bootypoppinnostoppin",
                                                "score": 0,
                                                "text": "The example I provided is literally destiny saying children are legitimate targets cause they came out of a Hamas compound, which is not even true. Will you engage with fact or just use buzzwords like destiny. It's big that you know the word rhetoric and good faith but do you actually understand what they mean",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzjl639",
                                                        "author": "BuyTheDip96",
                                                        "score": 5,
                                                        "text": "You're literally hearing what you want to hear, that's not what was said at all. Finklestein is saying (word for word) \"when Israel targets children.\"  \n\nWhat Destiny is saying is that these kids are coming out of a HAMAS COMPOUND. I.e. Israel is not targeting children. They are targeting Hamas compounds, that are intentionally built near civilians (human shields). \n\nAnd of course finklestein's only response is ad hominem lmao. \n\nDo you see what I'm saying? Literally what you just wrote is not what was said. I think you need to take a step back and actually listen to the words and process what's being said. I don't know how else to get through to you when you're viewing everything through your particular, biased lens.",
                                                        "replies": [
                                                            {
                                                                "comment_id": "kzjp5ti",
                                                                "author": "bootypoppinnostoppin",
                                                                "score": 1,
                                                                "text": "No I don't see what you're saying? Destiny made up a blatant lie so norm got pissed. There's article after article out that the kids came out of a fishing hut. But I'm sorry that finklestein hurt your little feelings for calling a liar a name",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "comment_id": "kzg26jk",
                                                "author": "bootypoppinnostoppin",
                                                "score": 0,
                                                "text": "One of the times Finkelstein loses it is when Destiny says the four children came out of a \"hamas base\". Not only is this blatantly false, but he explicitly called Finkelstein a liar, even though he has no idea what he's talking about.\n\nThe Guardian\n\nBut journalists who attended the scene in the immediate aftermath of the attack – including a reporter from the Guardian – saw a small and dilapidated fisherman's hut containing a few tools where the children had been playing hide-and-seek.\n\nDestiny says Palestinians rejection of the Camp David Summit offer is proof that it's impossible to make peace with them (until they abandon armed resistance alltogether). This is the map of the final offer. Anyone with eyeballs can look at the map and see it's a completely unreasonable offer and the Palestinians were completely legitimate in rejecting it.\n\nDestiny says the Palestinian position is \"delusional\", despite the fact that pretty much the entire world supports the Palestinian position, only Israel and the US rejects it. Ever single year the vote in the UN assembly is around 159-7. I guess the entire world is wrong and only Israel is rational?\n\nDestiny says \"plausible\" is an incredibly low standard, what he's forgetting is that it's not like if Israel barely clears the bar for not committing genocide that points to a serious and professionally run campaign that respects international law. Officially, this is supposed to be a serious war only targeting Hamas, the fact that things have gone so horribly that 15 out of 17 judges are willing to hear out whether a genocide is being committed is a sign turns have turned pretty horrible. The US campaign in Iraq was quite nasty in many ways, but no one thinks it's a remotely plausible genocide, and for that war it's pretty much a given across the entire political spectrum outside the neocons you oppose the Iraq War, primarily on moral grounds.\n\nDestiny has implied the casualty rates are normal, nothing is further from the truth. And this goes for almost any metric you use, the casualty rates are atrocious. Can anyone name a war where almost as many women die as men?\n\nDestiny says peace will only come if the Palestinians completely lay down their arms and pinky promise to never do any violence for years, I guess? Despite the fact Bibi has explicitly denied there will ever be a Palestinian state for decades, and this is a popular position among Israelis.\n\nDestiny implied the Great March of Return was not non-violent, even in the beginning, to the contrary of pretty much every human rights organization reporting on the event, he also got the months wrong and Finkelstein calls him out on that.\n\nDestiny apparently wants evidence that Gaza was a bad place to live and questions the validity of every single human rights report and scholarship which has been done about Gaza, the only reason? Relatively low child mortality and relatively high life expectancy. With that logic, I suppose Cuba has a higher living standard that the United States? North Korea has a relatively high life expectancy, I guess the tankies were right about Kim Jong-Un then? Gaza has had for a long time around 40 % unemployment, it survives purely off of foreign aid, the population outside of some workers in Israel and Egypt are prevented from leaving, most of the water is polluted, it's enormously population dense and is subjected to regular massacres, which kills mostly civilians, sometimes over a thousand or two thousand.\n\nThere's other stuff he's said that's pretty horrifying, like how children from \"that part of the world\" shouldn't count as \"children\" because they're child soldiers, but that wasn't brought up in this debate. If it was, Finkelstein probably would've ripped his head off.\n\nI'll add to this post if there's other things he spoke on that i can remember. I was thoroughly unimpressed.\n\nEdit: There were two arguments so stupid I actually forgot them. One of them is the \"if Israel don't kill everyone, that exonerates them\" and \"that it's not premissible to acquire territory through war is a stupid rule and should be ignored and it doesn't matter\". That was just unbelievable.\n\nThis isn't an argument, but it's pretty clear when he's giving his own monologues that he's just not on the level of the other ones. Instead of contructing serious arguments, for example he says that just because a civilian dies in a war doesn't mean it's a war crime,that's just just inane fluff that isn't relevant to the conversation, it's a transparent attempt to seem like he's involved and on the ball. It's like saying Israel isn't allowed to nuke Gaza, it's just an irrelevant comment.\n\nEdit: Destiny giggles at the idea of Israeli snipers targeting children. This (https://www.latimes.com/opinion/story/2024-02-16/rafah-gaza-hospitals-surgery-israel-bombing-ground-offensive-children) is an LA times opinion article from a doctor who travelled to Gaza and what he saw there. I recommend reading the entire article if you can stomach it, it's pretty brutal. Here's one paragraph:\n\n\"I stopped keeping track of how many new orphans I had operated on. After surgery they would be filed somewhere in the hospital, I'm unsure of who will take care of them or how they will survive. On one occasion, a handful of children, all about ages 5 to 8, were carried to the emergency room by their parents. All had single sniper shots to the head. These families were returning to their homes in Khan Yunis, about 2.5 miles away from the hospital, after Israeli tanks had withdrawn. But the snipers apparently stayed behind. None of these children survived.\"",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzjmy6v",
                                                        "author": "BuyTheDip96",
                                                        "score": 3,
                                                        "text": "Like I said, you can disagree with substance. If you want to debate substance of what *you* just said:\n\n1) you didn't link the guardian article and just gave one small snippet that did not say anything about there not being a Hamas compound. \n\n2) \"anyone with eyeballs\" is such a stupid comment. Clearly Palestinians have lost more and more territory as they only try to fight, lose, and move back to prior agreements. You can't expect to have everything handed back to you after you refuse to make peace over and over again. With a clear intent to remove a group of people off the face of the planet. Give me a fucking break. If Palestinians wanted that territory, maybe they should've taken any of the number of deals offered from 1950-camp David. \n\n3) \"willing to hear\" is not a standard for genocide. No amount of finger pointing at number of civilians killed changes the fact that Israel is performing the necessary cost benefit analysis of conducting urban ware fare in a densely populated zone, where the enemy uses its own civilians as human shields. Let me ask you a serious question - what should Israel realistically do? Immediate ceasefire, forget about the hostages, and just accept being constantly attacked for generations? What a stupid fucking comment my god. You don't give a shit about anything but virtue signaling for terrorist organizations. You're actually a disgusting person. \n\n4) in regards to Gaza quality of life - destiny is making statements in response to the mainstream narrative that it is \"unlivable\". The facts you pointed out go directly in the face of those stupid narratives people like you spread. No, it's not the only metrics that matter. But it shows how stupid reporting has been in this matter, and idiots like you just eat it up. \n\nBut this conversation has fundamentally been about who is acting in good faith here. Finklestein is not. He never once responded with facts despite being a \"historian\" who's spent his life on the topic. Finklestein is a literal grifter, who makes nonsensical arguments to the point of outright lying to get people like you to eat it up and spread this propaganda. You don't care about anything getting better in Gaza. You care about virtue signaling and misinterpreting any point made in the contrary to your \"beliefs\" to the point of straw man. Just all around horrible engagement with the material and I think you need to rewatch with an actual open mind.",
                                                        "replies": [
                                                            {
                                                                "comment_id": "kzjpdh9",
                                                                "author": "bootypoppinnostoppin",
                                                                "score": 1,
                                                                "text": "The event happened in 2016, if you were aware of what happened you'd know they didn't come out of a Hamas compound. Educate yourself",
                                                                "replies": []
                                                            },
                                                            {
                                                                "comment_id": "kzjq8ed",
                                                                "author": "bootypoppinnostoppin",
                                                                "score": 1,
                                                                "text": "Do yourself a favor and actually read https://www.theguardian.com/world/2015/jun/11/israel-clears-military-gaza-beach-children this shit is Israel's MO. They are just like our police. They investigate themselves and find no issues with any of the horrific things they do",
                                                                "replies": []
                                                            },
                                                            {
                                                                "comment_id": "kzjqspf",
                                                                "author": "bootypoppinnostoppin",
                                                                "score": 1,
                                                                "text": "I literally spent an hour painstakingly laying out how destiny was not acting in good faith. Are you going to show me where norm blatantly lies or are you just going to keep making up nonsense. Calling destiny an idiot has nothing to do with \"arguing in good faith\" I don't think you know what that phrase means. Destiny isn't arguing in good faith because he is literally making up random shit\n\nAnd sorry Idk why the map and the links I originally linked did not work\n\n[https://www.theguardian.com/world/2015/jun/11/israel-clears-military-gaza-beach-children](https://www.theguardian.com/world/2015/jun/11/israel-clears-military-gaza-beach-children)\n\n[https://www.washingtonpost.com/news/worldviews/wp/2014/07/16/dispatch-israeli-strike-kills-four-children-at-a-gaza-beach/](https://www.washingtonpost.com/news/worldviews/wp/2014/07/16/dispatch-israeli-strike-kills-four-children-at-a-gaza-beach/)\n\n[https://www.reddit.com/r/MapPorn/comments/174lotx/camp\\_david\\_peace\\_plan\\_proposal\\_2000/](https://www.reddit.com/r/MapPorn/comments/174lotx/camp_david_peace_plan_proposal_2000/)\n\n  \n[https://www.reddit.com/r/stupidpol/comments/193f3e1/comparing\\_civilian\\_deaths\\_in\\_gaza\\_to\\_other/](https://www.reddit.com/r/stupidpol/comments/193f3e1/comparing_civilian_deaths_in_gaza_to_other/)\n\n  \n[https://www.latimes.com/opinion/story/2024-02-16/rafah-gaza-hospitals-surgery-israel-bombing-ground-offensive-children](https://www.latimes.com/opinion/story/2024-02-16/rafah-gaza-hospitals-surgery-israel-bombing-ground-offensive-children)",
                                                                "replies": [
                                                                    {
                                                                        "comment_id": "kzjypsq",
                                                                        "author": "BuyTheDip96",
                                                                        "score": 2,
                                                                        "text": "What do you think arguing in bad faith means? How does calling someone an idiot with no counter factual or substance not meet that criteria?",
                                                                        "replies": [
                                                                            {
                                                                                "comment_id": "kzjz55v",
                                                                                "author": "bootypoppinnostoppin",
                                                                                "score": 1,
                                                                                "text": "He literally said in the interview that they did not come from a Hamas compound?? Finklestein counters destinys points many times, you just didn't watch the interview. And again, it's impossible to counter made up nonsense constantly, how is finklestein suppose to counter things that he's never heard of because they are made up? Making up shit is not arguing in good faith lmao. How are you this dense??? I provided example after example of destiny not arguing in good faith and just plainly lying. It's your turn to back up your claim",
                                                                                "replies": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "comment_id": "kzg0n1e",
                                                "author": "bootypoppinnostoppin",
                                                "score": -1,
                                                "text": "I mean I agree that destiny is a dumbass if that's what you mean? But the entire debate is full of him citing historical events and portions of morris' book. You didn't watch the interview which is fine I get you don't have a long enough attention span",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzjn9ag",
                                                        "author": "BuyTheDip96",
                                                        "score": 4,
                                                        "text": "I'm not saying anyone here is a \"dumbass.\" If destiny was a dumbass, norm should have showcased that with actual facts and not ad hominem attacks. Finklestein looks absolutely horrible throughout this entire conversation. I don't know why you can't actually engage with the material instead of spinning everything to fit your own personal narrative.",
                                                        "replies": [
                                                            {
                                                                "comment_id": "kzjprw1",
                                                                "author": "bootypoppinnostoppin",
                                                                "score": 0,
                                                                "text": "It's hard to debate facts in a debate when the other party is just making up things, that is what I was trying to showcase. If you were an academic who spent decades studying you'd be mad about some twerp streamer pretending he knows what he's talking about and getting basic facts wrong. Thats what's wrong with debates, they're hard if your opponent is in there making shit up like destiny was. Honestly norm wasn't even that mean to him. If you actually understood the conflict you'd see why he was so frustrated but you dont",
                                                                "replies": [
                                                                    {
                                                                        "comment_id": "kzpwhii",
                                                                        "author": "TheAncientRuinz",
                                                                        "score": 1,
                                                                        "text": "If destiny made stuff up then it'd be easy to refute...",
                                                                        "replies": [
                                                                            {
                                                                                "comment_id": "kzpwtf0",
                                                                                "author": "bootypoppinnostoppin",
                                                                                "score": 1,
                                                                                "text": "It literally is. He said that the kids came out of a Hamas compound in that 2014 event where to idf killed 4 kids on a beach. They came out of a fishing hut, that's one of many, do you want more?\n\nhttps://www.theguardian.com/world/2015/jun/11/israel-clears-military-gaza-beach-children\n\nIt is difficult though in a debate format to dispute a myriad of lies your opponent is spewing. Real time fact checking nonsense is not that easy",
                                                                                "replies": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "comment_id": "kzf1k2w",
                        "author": "An1meK1ng",
                        "score": 8,
                        "text": "Wow you sound so knowledgeable. Maybe you can enlighten us. Just hop on his stream and destroy this loser.",
                        "replies": [
                            {
                                "comment_id": "kzf1xur",
                                "author": "bootypoppinnostoppin",
                                "score": 0,
                                "text": "lmfao there it is. Finklestein is literally a academic who is studying this topic his whole life, he lays out the entire history of the conflict in the first ten minutes of the interview. You very clearly didnt watch the interview you pathetic destiny fanboy. Theres literally a point in the conversation just before the hour mark where destiny cant even engage cause he hasnt read Proff Morris books, while Finklestein had.",
                                "replies": [
                                    {
                                        "comment_id": "kzkdt4y",
                                        "author": "An1meK1ng",
                                        "score": 4,
                                        "text": "here comes the cope. lil bro Finklestein couldn't even name a simple legal term and incorrectly(like a arrogant idiot) tried to correct destiny. i would off myself if a ipad kid embarrassed me like that. \n\n>Theres literally a point in the conversation just before the hour mark where destiny cant even engage cause he hasnt read Proff Morris books, while Finklestein had.\n\nyou mean when finkelstein lied about no mention of antisemitism in morris's book? people literally searched the pdf and found it lolol. please get a better academic next time.",
                                        "replies": [
                                            {
                                                "comment_id": "kzkibji",
                                                "author": "bootypoppinnostoppin",
                                                "score": 1,
                                                "text": "One of the times Finkelstein loses it is when Destiny says the four children came out of a \"hamas base\". Not only is this blatantly false, but he explicitly called Finkelstein a liar, even though he has no idea what he's talking about.\n\n[The Guardian](https://www.theguardian.com/world/2015/jun/11/israel-clears-military-gaza-beach-children)\n\n>\n\nDestiny says Palestinians rejection of the Camp David Summit offer is proof that it's impossible to make peace with them (until they abandon armed resistance alltogether). [This](https://www.reddit.com/r/MapPorn/comments/174lotx/camp_david_peace_plan_proposal_2000/) is the map of the final offer. Anyone with eyeballs can look at the map and see it's a completely unreasonable offer and the Palestinians were completely legitimate in rejecting it.\n\nDestiny says the Palestinian position is \"delusional\", despite the fact that pretty much the entire world supports the Palestinian position, only Israel and the US rejects it. Ever single year the vote in the UN assembly is around 159-7. I guess the entire world is wrong and only Israel is rational?\n\nDestiny says \"plausible\" is an incredibly low standard, what he's forgetting is that it's not like if Israel barely clears the bar for not committing genocide that points to a serious and professionally run campaign that respects international law. Officially, this is supposed to be a serious war only targeting Hamas, the fact that things have gone so horribly that 15 out of 17 judges are willing to hear out whether a genocide is being committed is a sign turns have turned pretty horrible. The US campaign in Iraq was quite nasty in many ways, but no one thinks it's a remotely plausible genocide, and for that war it's pretty much a given across the entire political spectrum outside the neocons you oppose the Iraq War, primarily on moral grounds.\n\nDestiny has implied the casualty rates are normal, [nothing is further from the truth](https://www.reddit.com/r/stupidpol/comments/193f3e1/comparing_civilian_deaths_in_gaza_to_other/). And this goes for almost any metric you use, the casualty rates are atrocious. Can anyone name a war where almost as many women die as men?",
                                                "replies": []
                                            },
                                            {
                                                "comment_id": "kzkid41",
                                                "author": "bootypoppinnostoppin",
                                                "score": 1,
                                                "text": "Destiny says peace will only come if the Palestinians completely lay down their arms and pinky promise to never do any violence for years, I guess? Despite the fact Bibi has explicitly denied there will ever be a Palestinian state for decades, and this is a popular position among Israelis.\n\nDestiny implied the Great March of Return was not non-violent, even in the beginning, to the contrary of pretty much every human rights organization reporting on the event, he also got the months wrong and Finkelstein calls him out on that.\n\nDestiny apparently wants evidence that Gaza was a bad place to live and questions the validity of every single human rights report and scholarship which has been done about Gaza, the only reason? Relatively low child mortality and relatively high life expectancy. With that logic, I suppose Cuba has a higher living standard that the United States? North Korea has a relatively high life expectancy, I guess the tankies were right about Kim Jong-Un then? Gaza has had for a long time around 40 % unemployment, it survives purely off of foreign aid, the population outside of some workers in Israel and Egypt are prevented from leaving, most of the water is polluted, it's enormously population dense and is subjected to regular massacres, which kills mostly civilians, sometimes over a thousand or two thousand.\n\nThere's other stuff he's said that's pretty horrifying, like how children from \"that part of the world\" shouldn't count as \"children\" because they're child soldiers, but that wasn't brought up in this debate. If it was, Finkelstein probably would've ripped his head off.\n\nI'll add to this post if there's other things he spoke on that i can remember. I was thoroughly unimpressed.\n\nEdit: There were two arguments so stupid I actually forgot them. One of them is the \"if Israel don't kill everyone, that exonerates them\" and \"that it's not premissible to acquire territory through war is a stupid rule and should be ignored and it doesn't matter\". That was just unbelievable.\n\nThis isn't an argument, but it's pretty clear when he's giving his own monologues that he's just not on the level of the other ones. Instead of contructing serious arguments, for example he says that just because a civilian dies in a war doesn't mean it's a war crime,that's just just inane fluff that isn't relevant to the conversation, it's a transparent attempt to seem like he's involved and on the ball. It's like saying Israel isn't allowed to nuke Gaza, it's just an irrelevant comment.\n\nDestiny giggles at the idea of Israeli snipers targeting children. This ([https://www.latimes.com/opinion/story/2024-02-16/rafah-gaza-hospitals-surgery-israel-bombing-ground-offensive-children](https://www.latimes.com/opinion/story/2024-02-16/rafah-gaza-hospitals-surgery-israel-bombing-ground-offensive-children)) is an LA times opinion article from a doctor who travelled to Gaza and what he saw there. I recommend reading the entire article if you can stomach it, it's pretty brutal. Here's one paragraph:\n\n\"I stopped keeping track of how many new orphans I had operated on. After surgery they would be filed somewhere in the hospital, I'm unsure of who will take care of them or how they will survive. On one occasion, a handful of children, all about ages 5 to 8, were carried to the emergency room by their parents. All had single sniper shots to the head. These families were returning to their homes in Khan Yunis, about 2.5 miles away from the hospital, after Israeli tanks had withdrawn. But the snipers apparently stayed behind. None of these children survived.\"",
                                                "replies": []
                                            },
                                            {
                                                "comment_id": "kzki8ji",
                                                "author": "bootypoppinnostoppin",
                                                "score": 0,
                                                "text": "I dont know exactly what youre talking about with the legal terms, Destiny was trying to argue semantics over what constitutes genocide and maybe thats what you mean, but arguing about genocide as a \"legal\" term is pointless when the ICC has no real authority and the US essentially decides what and how to enforce things. \n\nAnd im not sure what you are talking about since Finklestein literally says this: So Professor Morris, here's my problem. I didn't see that in your Righteous Victims. Even when you talked about the first Intifada, and you talked about the second Intifada, and you talked about how there was a lot of influence by Hamas, the Islamic movement, you even stated that there was a lot of antisemitism in those movements, but then you went on to say, \"But of course, at bottom, it was about the occupation. It wasn't about\" … And I've read it.\n\n  \nAddiotionally youre referencing one disagreement, here are the plethora of times Destiny lied and argued in bad faith or just clearly was in over his head with respect to understanding the topic BECAUSE HE IS NOT AN EXPERT.",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzgqdu0",
                "author": "Ok-Newt9780",
                "score": -9,
                "text": "Just saw your comment history. Is there something in life you aren't struggling with? Try to find a different hobby my man.",
                "replies": [
                    {
                        "comment_id": "kzhus7w",
                        "author": "An1meK1ng",
                        "score": 4,
                        "text": "What am I struggling with? Mr redditer",
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "kzfzlok",
                "author": "redthrowaway1976",
                "score": -16,
                "text": "For anyone who actually knows the historical record, Destiny was an absolute idiot.",
                "replies": [
                    {
                        "comment_id": "kzg224o",
                        "author": "FafoLaw",
                        "score": 14,
                        "text": "Then it should've been easy for Finkelstein to demonstrate that, instead he kept insulting Destiny without giving any arguments.",
                        "replies": [
                            {
                                "comment_id": "kzgh834",
                                "author": "mossbasin",
                                "score": 11,
                                "text": "Heck, if Destiny had said anything egregiously historically inaccurate, I'm sure even Benny would have gently corrected it, as the foremost historian in the room",
                                "replies": []
                            },
                            {
                                "comment_id": "kzhfc3t",
                                "author": "gotewarrior",
                                "score": 6,
                                "text": "And how many times did Benny say \"as Steven said...\" and \"Steven's right.\"?",
                                "replies": [
                                    {
                                        "comment_id": "kzhr0tj",
                                        "author": "FafoLaw",
                                        "score": 7,
                                        "text": "A few times, why?",
                                        "replies": [
                                            {
                                                "comment_id": "kzkaqu8",
                                                "author": "gotewarrior",
                                                "score": 5,
                                                "text": "Because that confirms that Destiny's views hold water according to an esteemed academic that Finkelstein respects. So u/redthrowaway1976 's claim that Destiny was an absolute idiot is insulting to both Finkelstein and Benny Morris.",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzkgix5",
                                                        "author": "FafoLaw",
                                                        "score": 4,
                                                        "text": "Good point.",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "comment_id": "kzp74ob",
                                "author": "redthrowaway1976",
                                "score": -1,
                                "text": "A lot of what Destiny said didn't even warrant a rebuttal. \n\nTake, for example, trying to make a point with \"the Palestinians never had a state\". Even Morris just ignored that statement, because it is inane and meaningless.",
                                "replies": [
                                    {
                                        "comment_id": "kzsbzyp",
                                        "author": "FafoLaw",
                                        "score": 1,
                                        "text": "It's a true statement, they didn't.",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "comment_id": "kzg2oeo",
                        "author": "An1meK1ng",
                        "score": 8,
                        "text": "What historically incorrect thing destiny said? Do provide a detailed answer since you're claiming you know a lot",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzfncpf",
        "author": "None",
        "score": 12,
        "text": "[removed]",
        "replies": [
            {
                "comment_id": "kzmvtvj",
                "author": "furryhunter7",
                "score": 2,
                "text": "in [this](https://youtu.be/FdEyuxSxBdQ?si=3drwgGAwAho_0mHc) interview he literally brags about how he went in planning to ruin the debate",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzeg4dj",
        "author": "hogback504",
        "score": 63,
        "text": "What did Destiny do wrong? He was patient amidst an onslaught of derogatory ad hominem from Finkelstein",
        "replies": [
            {
                "comment_id": "kzh69lb",
                "author": "ArchMurdoch",
                "score": 25,
                "text": "I agree destiny was very tolerant of finkelstein who was in my opinion unbearable",
                "replies": []
            },
            {
                "comment_id": "kzfzgoi",
                "author": "None",
                "score": -10,
                "text": "[removed]",
                "replies": [
                    {
                        "comment_id": "kzg0qz5",
                        "author": "FafoLaw",
                        "score": 13,
                        "text": "The point of that argument is that not all the land belonged to the Palestinians before the creation of Israel.",
                        "replies": [
                            {
                                "comment_id": "kzh7z53",
                                "author": "Real_Succotash7026",
                                "score": 2,
                                "text": "That argument rubs me so wrong to because that also means Jordan has stolen ~75% of Palestinians total land.",
                                "replies": [
                                    {
                                        "comment_id": "kzie03m",
                                        "author": "mymainmaney",
                                        "score": 2,
                                        "text": "You're almost getting it.",
                                        "replies": []
                                    },
                                    {
                                        "comment_id": "kzl39kb",
                                        "author": "Su_Impact",
                                        "score": 2,
                                        "text": "Some academics believe that a de facto 2SS already exists. The Palestinian state is simply called Jordan.\n\nI disagree with it but it's an argument worth exploring for academic purposes.",
                                        "replies": [
                                            {
                                                "comment_id": "kzotoj4",
                                                "author": "twohusknight",
                                                "score": 1,
                                                "text": "I mean it's not a huge leap when\n1) the original British Mandate included Jordan\n2) Jordan annexed the West Bank and offered citizenship to Palestinians there\n3) A consistent and, even to this day, persistent dream of a huge pan-Arab state that encompasses the Middle East including Israel, Jordan, Palestine, etc, the real 1SS Arabs have been calling for since at least the 1910s.\n\nI'm all for a 2SS with the present reality, but the fact that the Mandate will ultimately have split into 3 parts indicates we should probably be calling it the 3SS.",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "comment_id": "kzha3ss",
                                "author": "justanotherdamnta123",
                                "score": 2,
                                "text": "Except Israel took the land that did, and is actively preventing a Palestinian state on that land through its settlement project in the West Bank.",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "comment_id": "kzgkhr9",
                        "author": "No_Handle499",
                        "score": 10,
                        "text": "Destiny is right",
                        "replies": []
                    },
                    {
                        "comment_id": "kzgdkje",
                        "author": "Slayr698",
                        "score": 7,
                        "text": "At no point during or in every twitter thread or video finkle has done after has he ever pointed to a fact steven got wrong. Ideally he isn't needed in the discussion however I can't see anything compelling for finkle being a positive voice for the Palestinian cause if he only wants to misinterpret morris' statements when he is sitting across the table and try to ignore any dissenting opinion from someone who he decides is beneath him.",
                        "replies": []
                    },
                    {
                        "comment_id": "kzhfg11",
                        "author": "gotewarrior",
                        "score": 2,
                        "text": "So your critique is that he said a true statement?",
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "kzen8oq",
                "author": "finkelstiny",
                "score": -38,
                "text": "Putting Destiny in a room with Finkelstein was a bad idea to begin with. Finkelstein can smell weakness and it's difficult for a man with such strength and passion to contain himself, especially when he knows he has the power to erase Destiny's very essence from the universe.",
                "replies": [
                    {
                        "comment_id": "kzezwy0",
                        "author": "Sufficient_Target358",
                        "score": 30,
                        "text": "That's a lot of words to say finkelstein is a cry baby that can't handle talking to someone he deems \"lesser\".",
                        "replies": [
                            {
                                "comment_id": "kzf5bos",
                                "author": "hogback504",
                                "score": 16,
                                "text": "Finkelstein is a propagandist",
                                "replies": []
                            },
                            {
                                "comment_id": "kzfsxnt",
                                "author": "dickermuffer",
                                "score": 3,
                                "text": "Finkelstiny is obviously some troll account with that name, picture, and how the comment was written. \n\nIt's hilarious ",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "comment_id": "kzf47b5",
                        "author": "Masethelah",
                        "score": 16,
                        "text": "If Finkelstein actually was confident, do you think he would resort to screaming, ad hominem etc risking his reputation, rather than nail him on the facts? \n\nThe way he debated was of a man without confidence he could win fairly",
                        "replies": [
                            {
                                "comment_id": "kzh2iw3",
                                "author": "Unusual_Specialist58",
                                "score": 2,
                                "text": "It was more that he got frustrated Destiny was saying such outrageous things that were clearly from a place of ignorance and trying to pass it off as fact",
                                "replies": []
                            },
                            {
                                "comment_id": "kzfr8xi",
                                "author": "finkelstiny",
                                "score": 2,
                                "text": "Using Ad hominems shows dominance, it means you aren't afraid of escalating things into a physical altercation.",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzgqaol",
                "author": "Ok-Newt9780",
                "score": -6,
                "text": "Just saw your comment history. Is there something in life you aren't struggling with? Try to find a different hobby my man.",
                "replies": []
            },
            {
                "comment_id": "kzgjnhh",
                "author": "TheKingChadwell",
                "score": -4,
                "text": "He used very shallow, surface level, 101 style arguments. His points were very basic and anyone with experience had already bashed through them. It's like a freshman debating with a post doc.",
                "replies": []
            },
            {
                "comment_id": "kzfi0c5",
                "author": "Both_Recording_8923",
                "score": -6,
                "text": ">He was patient\n\nHahahah 🤣 good one\n\nHe wouldn't stop interrupting Norm and Rabbini throughout the debate, especially in the second half. I didnt like the insults Norm threw at destiny except for motormouth, that nickname was earned. He also asserted a baseless claim that Norm didn't actually read the UN resolutions that were being discussed",
                "replies": []
            },
            {
                "comment_id": "kzhprir",
                "author": "MembershipSolid2909",
                "score": -7,
                "text": "He spent 5 hours reading printouts from Wikipedia, trying to pass himself off as an expert.",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzeq3my",
        "author": "Comfortable-Wing7177",
        "score": 25,
        "text": "When did destiny do a personal attack?",
        "replies": [
            {
                "comment_id": "kzfanvl",
                "author": "Szabe442",
                "score": 29,
                "text": "I think he called him a pop historian once or twice, but it pales in comparison considering what Finkelstein was doing.",
                "replies": [
                    {
                        "comment_id": "kzhuasd",
                        "author": "Hannig4n",
                        "score": 7,
                        "text": "Which is generous considering Finkelstein's academic background isn't in history. He's not a historian at all, he can't assess the primary documents, which is why his only contribution to the first 3 hours of the debate discussing the history of the conflict was misquoting passages from Benny Morris's academic works.\n\nI don't think having people like Destiny and Rabbani is a problem despite neither of them having strong history credentials because they could both make reasonable rhetorical arguments and were approaching the discussion in good faith. But it was kind of strange to have a 2v2 debate arguing the finer details of the history of the conflict and only one of the guys there is an actual expert on the history.\n\nI think it would've gone a lot better if Lex invited an actual historian like Khalidi or someone who can argue from the pro-Palestinian side. Norm wasn't operating in good faith and didn't bring anything particularly valuable to the convo.",
                        "replies": [
                            {
                                "comment_id": "kzyaj7j",
                                "author": "Israelite123",
                                "score": 1,
                                "text": "finklestine is a joke",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzf725k",
                "author": "pickleinthepaint",
                "score": 18,
                "text": "The closest I can think of was when Destiny said Finkelstein was happy that Palestinians were being attacked. Basically saying as long as the topic is relevant, he'll be a celebrity, and Finkelstein cared more about that than a solution.",
                "replies": [
                    {
                        "comment_id": "kzfatt2",
                        "author": "Comfortable-Wing7177",
                        "score": 6,
                        "text": "Was this before or after finkeldick attacked him?",
                        "replies": [
                            {
                                "comment_id": "kzku337",
                                "author": "SnakeCharmer20",
                                "score": 4,
                                "text": "Wayyy after lol, near the end of the convo",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzfoomt",
                "author": "boriswied",
                "score": 5,
                "text": "I didn't hear him do many personal attacks, and in terms of those, finkelstein certainly started and kept the shitthrowing going much more.\n\nThat being said he did let himself get riled up and resorted to straw men and a anger filled rants.\n Rabbani and Morris were both a lot nicer to listen to imho. I think even Morris got a little shrill at rare times.",
                "replies": [
                    {
                        "comment_id": "kzk4yjm",
                        "author": "Comfortable-Wing7177",
                        "score": 2,
                        "text": "Strawmanning isnt a personal attack, and he would probably disagree that he strawmanned. Thats part of the debate.\n\nBeing angry is also ok, theres no need for a true academic debate setting for the public, period, ever. Academic debates are only useful at communicating between academics, not to the public.",
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "kzgtskc",
                "author": "No-Farmer-4068",
                "score": -3,
                "text": "He asked him \"did you even read it?\" In reference to some report Which was obviously silly. Also he did accuse Fink of cherry picking his quotes/references— I understand that good faith was lost between the two however, and I don't think Fink should personally attack Destiny the way he did. I also found it absurd when Destiny and Fink argued about Latin terms from the Wikipedia genocide page. In general, Destiny comes across as a well prepared debater who is clearly new to the topic and Fink comes across as someone who is actually passionate about the topic and has been. This takes away from the validity of destiny's arguments in some kind of context. It sometimes seems that Destiny isn't deep enough on the topic to have come to his conclusions on his own. He doesn't seem to actually care about the Israel/Palestine question as much. This is due to his recent interest lining up with the recent media circus around it. I actually agree with Destiny's point of view more in general on the topic, but I don't think Fink is totally unhinged for pointing out that he's gone so much deeper.",
                "replies": [
                    {
                        "comment_id": "kzhqwop",
                        "author": "fridiculou5",
                        "score": 9,
                        "text": "Honestly, if Finklestien studied the UN primary documents, he should have been able to properly contextualize mens rea and dolus specialis as it is the means by which genocide is determined.\n\nHis lack of comprehension was quite surprising.",
                        "replies": [
                            {
                                "comment_id": "kzhv5jr",
                                "author": "Hannig4n",
                                "score": 7,
                                "text": "Finkelstein didn't even seem aware of the arguments brought out in Judge Nolte's declaration or the dissenting opinion from the ICJ. That's most of what Destiny was referencing. He insisted that he read the ICJ summary four times but apparently neglected everything else.\n\nI got the impression that he doesn't particularly like to engage with evidence that doesn't support his priors.",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "comment_id": "kzgu5ko",
                        "author": "Comfortable-Wing7177",
                        "score": 4,
                        "text": "Did you watch the debate? Being passionate is no excuse for Fink being are complete child with personal attacks, destiny accusing dinkleberg of cherry picking sources isnt a personal attack\n\nAlso generally being passionate about a topic is a bad thing because it removes your ability to speak without bias",
                        "replies": []
                    },
                    {
                        "comment_id": "kzhfnos",
                        "author": "gotewarrior",
                        "score": 6,
                        "text": "You're speaking about the *mens rea* and *dolus specialis* distinction, which is genuinely relevant for a discussion as to whether something qualifies as genocide.",
                        "replies": []
                    },
                    {
                        "comment_id": "kzk923c",
                        "author": "hotpajamas",
                        "score": 3,
                        "text": "I thought the \"did you read it\" snark was appropriate given how many times before that Fink claimed to have read everything about this topic \"not once, but 3 times\" without really any substance to support that claim. \n\nHis approach was always about authority and credentials so to not have any idea what the text said yet to have claimed so much about reading everything.. Yeah he deserved it.",
                        "replies": []
                    },
                    {
                        "comment_id": "kzgu8p1",
                        "author": "Comfortable-Wing7177",
                        "score": 2,
                        "text": "How would go about measuring \"whos gone deeper\"?",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzeqj1j",
        "author": "Training-Gold5996",
        "score": 30,
        "text": "I really liked Finkelstein when I've heard him before and found his grasp of this issues extremely persuasive.\n\nI was actuslly pretty shocked with how badly he showed up in this debate. From sort of playing gotcha with Morris's words from decades ago to just unacceptable and hominen attacks on whoever was the partner to Morris, none of it was a good look.",
        "replies": [
            {
                "comment_id": "kzhoxfl",
                "author": "Lysbird",
                "score": 6,
                "text": "Agreed",
                "replies": []
            },
            {
                "comment_id": "kzoc62u",
                "author": "asdfasdflkjlkjlkj",
                "score": 1,
                "text": "Finkelstein was personally annoying in that debate, but the charge that he's playing gotcha or misreading Morris' words is really mistaken. I get why people on the internet find it persuasive but they're being bamboozled by their lack of context. Morris' political views have shifted rightward over time, and there are many people, (including credible historians), who believe that in an effort to justify his current politics, he's ended up misrepresenting, or failing to draw obvious conclusions from his earlier work. Finkelstein is making a totally reasonable argument on the basis of Morris' research, and he's charging that Morris is backpedalling his research because he doesn't like the conclusions it allows critics of Zionism to draw.",
                "replies": []
            },
            {
                "comment_id": "kzomfet",
                "author": "ermahgerdstermpernk",
                "score": 1,
                "text": "He's always been bad.  Look up his lectures from the 2000s or even a couple years ago\n\nhttps://youtu.be/OZR-YowflEI?si=0PlHWBrV__Odk0ev",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzgclny",
        "author": "krumlalumla",
        "score": 15,
        "text": "Destiny didn't resort to personal attacks. Finkelstein did.",
        "replies": [
            {
                "comment_id": "kzhvloz",
                "author": "None",
                "score": -4,
                "text": "[deleted]",
                "replies": [
                    {
                        "comment_id": "kzig4l8",
                        "author": "Professional-Fan266",
                        "score": 3,
                        "text": "maybe, but what was even the point of those insult's",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzij963",
        "author": "Next-Jump-3321",
        "score": 3,
        "text": "Whole heartedly agree. At times it was unbearable to listen to but I did.",
        "replies": []
    },
    {
        "comment_id": "kzka4ps",
        "author": "hotpajamas",
        "score": 3,
        "text": "I don't think Fink is good for this medium. Not only because he talks slow to the point of being disrespectful but because he's not open-minded to being wrong. Maybe he's a better author than orator. \n\nHe later said in clear enough terms for me that he took the debate in bad faith from the get-go because he didn't respect Destiny. He never had any intention of engaging with him at all. That should be enough not to be invited to the next one.",
        "replies": []
    },
    {
        "comment_id": "kzec0q8",
        "author": "None",
        "score": 10,
        "text": "[deleted]",
        "replies": [
            {
                "comment_id": "kzeoylp",
                "author": "Savings-Sell5343",
                "score": -3,
                "text": "History did not begin on october 7",
                "replies": [
                    {
                        "comment_id": "kzf0xch",
                        "author": "Deshawn_Allen",
                        "score": 15,
                        "text": "This is a stupid statement I see all over Reddit. History also did not begin whenever you feel like starting it",
                        "replies": []
                    },
                    {
                        "comment_id": "kzf6f07",
                        "author": "None",
                        "score": 3,
                        "text": "[deleted]",
                        "replies": [
                            {
                                "comment_id": "kzfb04x",
                                "author": "Szabe442",
                                "score": -1,
                                "text": "But the whole conflict is about the history of that  land and how the sides view those historical events. I don't understand how you can skip any of that.",
                                "replies": [
                                    {
                                        "comment_id": "kzfbjur",
                                        "author": "None",
                                        "score": 0,
                                        "text": "[deleted]",
                                        "replies": [
                                            {
                                                "comment_id": "kzfd59v",
                                                "author": "Szabe442",
                                                "score": -1,
                                                "text": "I am saying there is nothing else to discuss. Current events are driven by historical events. to understand and evaluate them you need to understand their history.",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzhs1k4",
        "author": "Dextorius",
        "score": 5,
        "text": "I thought Destiny was fine. Finkelstein was rude and dismissive to Destiny the entire time. Cole Hughes and Marc Lamont Hill would be good.",
        "replies": []
    },
    {
        "comment_id": "kzfgxr4",
        "author": "Both_Recording_8923",
        "score": 2,
        "text": "No. Bring in Smuley and Cenk",
        "replies": []
    },
    {
        "comment_id": "kzjanzr",
        "author": "Wassimans",
        "score": 1,
        "text": "I'll start enjoying that kind of debate when justice makes its way to the real world. Till then I'll just keep calm and watch the US playing veto games while the rest of world enjoys the show.",
        "replies": []
    },
    {
        "comment_id": "kzltdwa",
        "author": "Durtkl",
        "score": 1,
        "text": "It's rarely calm",
        "replies": []
    },
    {
        "comment_id": "kzlw0v2",
        "author": "ME-grad-2020",
        "score": 1,
        "text": "It's so amazing to me that people think Destiny was just as bad as finkelstein. Even now, after norm admitting publicly he was purely present to [derail](https://youtu.be/FdEyuxSxBdQ?si=L_ph7RErUgG_4zQl) the conversation. \n\nI would expect a conversation between avi shlaim and Benny Morris would be pretty illuminating since it would be a stimulating discussion on the history of the region. \n\nFor political/strategic perspectives, it has to be between media personalities and debaters well versed in the topic. I think a 1 on 1 conversation between either Marc Lamont hill, Omar Sulaiman vs Destiny, ben Shapiro would be a productive one. \n\nOne again, people who think Destiny was as bad as Norm Finkelstein are purely going off clips, or they are intentionally saying this because they hate him or his positions. Here is another [example](https://youtu.be/dJeQo0HjGos?si=lYnoyEbRJG38laK9) of norm admitting that he was only there to troll. He apparently thought that he would be perceived weak if he chose not to attend, and also admits that his behavior was optically hurtful to the discourse.",
        "replies": []
    },
    {
        "comment_id": "kzlxk8g",
        "author": "NVincarnate",
        "score": 1,
        "text": "What's the point of a calm and collected debate about this topic? An academic explanation as to why American taxpayers are funding mass murder?",
        "replies": []
    },
    {
        "comment_id": "kzm1pst",
        "author": "Ok-Marsupial8141",
        "score": 1,
        "text": "Imo the most powerful moment of the debate was when Lex asked what gave each side \"hope\" for the future and basically everyone more or less said the Israel-Palestine situation in its current form is hopeless... \n\nI enjoy Lex's individual guests who have different perspectives on the Israel-Palestine conflict, but I doubt another debate would be constructive.",
        "replies": []
    },
    {
        "comment_id": "kzm7j0p",
        "author": "Super_Automatic",
        "score": 1,
        "text": "I'd rather literally any other topic.",
        "replies": []
    },
    {
        "comment_id": "kzymgv5",
        "author": "KrntlyYerknOv",
        "score": 1,
        "text": "I largely agree with your take..except for the part about Destiny being In any way disrespectful.  I didn't see that.  I'm no fan or anything I just thought he conducted himself honorably in the face of Finkelsteins tantrums.",
        "replies": []
    },
    {
        "comment_id": "kzo3nav",
        "author": "JZcomedy",
        "score": 1,
        "text": "Ilan Pappe would be a great person to have",
        "replies": []
    },
    {
        "comment_id": "kzeic24",
        "author": "Jimger_1983",
        "score": -6,
        "text": "I know I'll get downvoted but it should have been Ben Shapiro not Destiny. I knew Destiny would be unprepared and get steamrolled. Ben would have made it his business to be ready and given his history debating college students he'd know how to turn Finkelstein's derisive tactics against him.",
        "replies": [
            {
                "comment_id": "kzf0bqv",
                "author": "Sufficient_Target358",
                "score": 7,
                "text": "Eh I thought bunnel-cake did fine. Feinstein had to resort to just insulting him and not engaging with the facts he brought up.",
                "replies": []
            },
            {
                "comment_id": "kzjrgwf",
                "author": "Sisyphean--",
                "score": 2,
                "text": "How do you look at his notes that are public and say he was unprepared [https://publish.obsidian.md/destiny/Debate+Prep/2024.02.28+-+Finkelstein+and+Rabbani/Debate+Outline](https://publish.obsidian.md/destiny/Debate+Prep/2024.02.28+-+Finkelstein+and+Rabbani/Debate+Outline)",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kze8iqt",
        "author": "None",
        "score": -9,
        "text": "[removed]",
        "replies": [
            {
                "comment_id": "kzepy75",
                "author": "Vinnie87",
                "score": 6,
                "text": "The debate was ruined by Finkelstein not sticking to any points and just ad homing destiny. Super childish",
                "replies": [
                    {
                        "comment_id": "kzfynit",
                        "author": "MembershipSolid2909",
                        "score": -5,
                        "text": "Norm is debating somebody who likes to be called 'Destiny'. 🙄",
                        "replies": [
                            {
                                "comment_id": "kzg0ts6",
                                "author": "Vinnie87",
                                "score": 3,
                                "text": "It's been his internet tag name for like 20 years, he asked to be called by his name in the debate and finkledick kept calling him the wrong name. But sure, again, go with the ad homs instead of responding to the topic at hand",
                                "replies": [
                                    {
                                        "comment_id": "kzg92dd",
                                        "author": "MembershipSolid2909",
                                        "score": -1,
                                        "text": "Firstly the ad homs started with Destiny. And secondly, he is still using a tag name from years ago? That is not the defense you think it is...",
                                        "replies": [
                                            {
                                                "comment_id": "kzhfwnz",
                                                "author": "gotewarrior",
                                                "score": 2,
                                                "text": "No, they didn't. If you mean the debate, Finkelstein did that first. If you mean their prior interactions, Finkelstein again did that during their first email / twitter exchange.",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzenrpf",
        "author": "Sybbian",
        "score": 0,
        "text": "No more politics, it's painful to watch.",
        "replies": []
    },
    {
        "comment_id": "kzdzmxy",
        "author": "SoulAssassin808",
        "score": -29,
        "text": "If I was one of the leading academics and I had to \"debate\" an iPad kid. I'd get frustrated too.",
        "replies": [
            {
                "comment_id": "kze9v06",
                "author": "adachisanchez",
                "score": 17,
                "text": "Yes, however, and I say this as someone that thinks Finkelstein had good points and has enough knowledge that he could potentially counter most arguments thrown by destiny.\n\nThrowing personal attacks and dismissing people because they are young and uninformed only detracts from your credibility. It's in a certain way, very lazy, and doesn't lead to what we are here for, a debate.\n\nNo matter how much of an idiot you think the other person is. In a debate you NEED to counter the arguments, you need to hold your pride aside. \n\nYou need to understand the format in which you will be involved. \n\nA podcast, ergo, real time reasoning and answers with a sprinkle of documentation. Finkelstein seemed to believe he could talk like he was writing a dissertation and not having a conversation.\n\nEtc etc\n\nI'm not saying his arguments, the one he expressed were flawed, but the rest of the package was a sorry execution.",
                "replies": []
            },
            {
                "comment_id": "kzej4r9",
                "author": "Darkus_8510",
                "score": 9,
                "text": "Then why accept to go to a debate? Hell why not make a clown of the iPad kid if there is no substance to what they are saying? I feel like if Finklestein really was the top dog on this issue he should have dominated this conversation without being so unhinged.\n\nIMHO Mouin did really well, Morris and Destiny did good and Finklestein was atrocious.",
                "replies": [
                    {
                        "comment_id": "kzewt1s",
                        "author": "SoulAssassin808",
                        "score": -4,
                        "text": "Damn pass the Copium around brother.",
                        "replies": [
                            {
                                "comment_id": "kzgp2o3",
                                "author": "electricsyl",
                                "score": 3,
                                "text": "Damn please pick one point that destiny got wrong or Finkelstein got right in the whole 5 hour debate brother. \n\n\nJust one thing, that's all, one point from a 5 hour debate, you'll be the first finkelfan to do it. \n\n\nOr ignore that and proceed to tell me \"if I can't see that Morris and Destiny are idiots and Finkelstein is a genius than you can't help me.\" The Finkelstein way. ",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kze5ltw",
                "author": "MatthewNeubeck",
                "score": 15,
                "text": "Your leading acedemic doesn't speak either of the languages involved in this conflict, and didn't know one of two legal terms that has always defined what a genocide is, after a 40 year long career publishing exclusively about two topics— both of which he refers to as genocides.",
                "replies": [
                    {
                        "comment_id": "kzee0ae",
                        "author": "Chinesesingertrap",
                        "score": -5,
                        "text": "You aren't required to speak the language to be an academic on this topic the twitch streamer didn't even know where Israel was on a map during one of his streams",
                        "replies": [
                            {
                                "comment_id": "kzhgbw4",
                                "author": "gotewarrior",
                                "score": 3,
                                "text": "Are you talking about the Seterra misclick? I'm having a hard time even finding that clip, but if you have a link for more context, go ahead.",
                                "replies": [
                                    {
                                        "comment_id": "kzhgov6",
                                        "author": "Chinesesingertrap",
                                        "score": 1,
                                        "text": "Here's the link incredibly embarrassing for him found it on some other streamers YouTube though\n\nhttps://youtu.be/77fxEU56iIg?si=BE0vXka6TuO00RlO",
                                        "replies": [
                                            {
                                                "comment_id": "kzkawdg",
                                                "author": "gotewarrior",
                                                "score": 1,
                                                "text": "Do you have a timestamp? I'm not watching an hour and a half of President Sunday.",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzkb99b",
                                                        "author": "Chinesesingertrap",
                                                        "score": 1,
                                                        "text": "Try this\n\nhttps://twitter.com/JzeViewing/status/1720485097256714609",
                                                        "replies": [
                                                            {
                                                                "comment_id": "kzkdkp0",
                                                                "author": "gotewarrior",
                                                                "score": 1,
                                                                "text": "That's more useful, but I'd really love to see what's around that. He was responding to a chatter, but we're missing context (and the eastern coast of the Mediterranean is covered by his cam, too).\n\nEven without context and presuming that that he straight up didn't know where to look (although clearly he does know the region to some degree, as the map he was looking at doesn't say \"Turkey\" anywhere on it given that it's a Roman provincial map but he identified that he was looking in the wrong spot by referring to Anatolia as \"Turkey\"), I am fairly confident that he may have learned where Israel is in the several months between that clip and the Fridman podcast.\n\nDestiny is absolutely a troll, and he straight up sets himself up for clip chimps. Maybe this was such a thing, maybe it wasn't. I'll click through the Sunday video and see if I can find the context for this clip.\n\nETA: I skimmed through the Sunday clip, and the only map in it is one of Google Maps centered on Israel. So, that's not the origin of the classical Rome map clip.",
                                                                "replies": []
                                                            },
                                                            {
                                                                "comment_id": "kzkge0r",
                                                                "author": "gotewarrior",
                                                                "score": 1,
                                                                "text": "I found a longform clip of Destiny's stream from the day that the clip with the map of the Roman Empire was taken, and in it he's using Seterra doing the world map. At 19:52, he clicks on Palestine correctly. Note that in Seterra, it prompts you to click on the countries one at a time. If you get it right the first time, it fills it in white. If you miss once then get it, it fills it in yellow. If you miss twice then get  it, it fills it in orange. If you miss three or more times, it fills it in red. He has almost the whole world correct on first guesses, so I'm hard pressed to think he didn't know where Israel is on a map that same day. The link jumps to the moment in question, as I assume you don't want to watch four hours of Destiny's stream.\n\n[https://www.youtube.com/watch?v=MqBaJa0a0qc&t=1192s](https://www.youtube.com/watch?v=MqBaJa0a0qc&t=1192s)",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "comment_id": "kzf335q",
                                "author": "Kohvazein",
                                "score": 1,
                                "text": "Not an academic, a leading academic.\n\nHe is not a leading academic and it's reasonable  to expect a \"leading academic\" to know the language of the country he's claiming to be a professional in",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "comment_id": "kze8lqe",
                        "author": "iluvucorgi",
                        "score": -4,
                        "text": "Lack of Arabic or Hebrew is a red herring",
                        "replies": [
                            {
                                "comment_id": "kzef90u",
                                "author": "MatthewNeubeck",
                                "score": 6,
                                "text": "How is that a red herring? I feel like not speaking the languages of any of the original sources is a pretty big disqualification for being a \"leading\" academic on the subject. Did you mean red flag?",
                                "replies": [
                                    {
                                        "comment_id": "kzet3oh",
                                        "author": "iluvucorgi",
                                        "score": -2,
                                        "text": "Nope red herring,  especially when so much material is avaliable in English and the subject matter so broad with different specialities \n\nIs it an advantage sure, is it a requirement,  not so much.    Which people would you consider leading academics.",
                                        "replies": [
                                            {
                                                "comment_id": "kzf2iqx",
                                                "author": "MatthewNeubeck",
                                                "score": 5,
                                                "text": "No, it absolutely is a requirement to be a \"leading\" scholar. You can't lead anyone if you require other scholars to even begin your work. You're relying on the interpretation of words by other people, you can't then claim to understand the subject better than anybody else. Of course that's disqualifying.",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzf66cg",
                                                        "author": "iluvucorgi",
                                                        "score": 0,
                                                        "text": "That's simply not true, especially on this topic",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "comment_id": "kzftbwf",
                                                "author": "Careful_Pin_3122",
                                                "score": 3,
                                                "text": "tell me you only speak english without telling me you only speak english.",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzi7xpz",
                                                        "author": "iluvucorgi",
                                                        "score": 1,
                                                        "text": "Tell me its a character attack after all....\n\n\nWhat language do Amnesty,  UN, us state department,  world Bank, EU, IMF all publish in,",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "comment_id": "kzhscej",
                                                "author": "fridiculou5",
                                                "score": 1,
                                                "text": "The whole point of research is to look at primary evidence (in its native language and context) and explore to what extent it challenges the status quo of thinking.\n\nIn the language case, both Hebrew and Arabic have such significant singles in their meaning, tone, grammar, idioms, that without it, you miss the context of the statement in translation",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzi7oze",
                                                        "author": "iluvucorgi",
                                                        "score": 0,
                                                        "text": "It depends what aspects you are researching.  So if you spend your adult life reading international law and reports from ngos and the state department,  English would be the language you would absolutely need, along with a huge Canon of historical literature by specialist academics who publish in English.",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "comment_id": "kzhh8kg",
                                "author": "gotewarrior",
                                "score": 1,
                                "text": "As someone who studies languages, there's a ton of context and implicit information in word choice. If you're reading a translation, then you're absorbing the translator's bias and interpretation. A scholar can absolutely account for others' bias and interpretation, but they need to understand what those biases are and how they are interpreting things. You can be a pretty solid scholar if you can rely on others to assist with that, but you're obliged to know the languages involved in a niche if you make that your life's work and want to stand at the forefront of that niche.\n\nFor example, if I were trying to translate \"J'ai fait la grosse matinée hier\", I could literally translate it as \"I made the fat morning yesterday\", and that would be both technically correct and meaningfully wrong. A far better translation would be \"I slept in yesterday\", but depending on the context it could even mean something like \"I burnt daylight yesterday\" if it had a negative connotation. I would only know by being able to interpret the context around it, and relying on translators means any errors they make are automatically included within your work as well as any errors that you make on top of that.",
                                "replies": [
                                    {
                                        "comment_id": "kzi7j6x",
                                        "author": "iluvucorgi",
                                        "score": 1,
                                        "text": ">As someone who studies languages, there's a ton of context and implicit information in word choice. If you're reading a translation, then you're absorbing the translator's bias and interpretation\n\n\nThat's not in dispute,  however so much of the academic work is done in English covering topics like ngo reports  international law , all authiored and conducted in English.\n\nSo it's clearly a red herring used to disparage in this instance.",
                                        "replies": [
                                            {
                                                "comment_id": "kzka3fi",
                                                "author": "gotewarrior",
                                                "score": 1,
                                                "text": "It's not. You can't handwave away the fact that the topic is highly contentious. When Finkelstein is quoting Morris who's translating quotes from Israeli prime ministers, he's literally unable to have a \"gotcha\" because Morris knows what he meant when he translated it the way he did into English. However, if Finkelstein could read and understand the primary source in Hebrew, then he could say that Morris misunderstands it, etc.",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzkrhvv",
                                                        "author": "iluvucorgi",
                                                        "score": 1,
                                                        "text": "Where have i said that the issue isn't  contentious.  He doesn't need a gotcha. You are referring to a conversation not a piece of academic writing.  What do you think a leading academic would do....",
                                                        "replies": [
                                                            {
                                                                "comment_id": "kzlwu89",
                                                                "author": "gotewarrior",
                                                                "score": 1,
                                                                "text": "Not what Finkelstein did. He's ignorant to the original documents and relies on translations from people who disagree with him. That's an untenable position to be considered a leading academic, and his lack of decorum and failure to present meaningful corrections to a non-academic is legitimately damning.",
                                                                "replies": [
                                                                    {
                                                                        "comment_id": "kzlznzs",
                                                                        "author": "iluvucorgi",
                                                                        "score": 1,
                                                                        "text": "That doesn't stop one being a leading academic,  especially given how much material,  like from the un, world Bank. Eu, Amnesty,  is in English \n\n\nPretty sure he has access to translation tools",
                                                                        "replies": [
                                                                            {
                                                                                "comment_id": "kznstoc",
                                                                                "author": "gotewarrior",
                                                                                "score": 1,
                                                                                "text": "You're not really assessing these things clearly. Just to establish a baseline of familiarity before anything else,  have you done academic research beyond the undergraduate level?",
                                                                                "replies": [
                                                                                    {
                                                                                        "comment_id": "kzqip8b",
                                                                                        "author": "iluvucorgi",
                                                                                        "score": 0,
                                                                                        "text": "Weird how so many leading experts on these things who read, analyse and author the very things I cited don't speak Hebrew. But go with the argument from authority fallacy if you please,  but you should have learnt that long before post grad",
                                                                                        "replies": [
                                                                                            {
                                                                                                "comment_id": "kzw88lx",
                                                                                                "author": "gotewarrior",
                                                                                                "score": 1,
                                                                                                "text": "Do their arguments consist of more than telling the translator that they use what he meant when he disagrees with them? If so, then they're being more diligent than Norman.\n\nI wasn't using an argument from authority. If you'll take the time to read my post, you'll see that I was asking about your familiarity with academia. If you are unfamiliar with academia, then you need to provide some additional support for your opinions on what validates scholarship, as I can't know what you're using as your basis. The credential, in this case, is a synecdoche of a general understanding to allow for a common language rather than a validation of your view.\n\nBased on your defensiveness, I'm not really interested in continuing things further. You can have the last word.",
                                                                                                "replies": []
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kze3p10",
                "author": "International-Fix799",
                "score": 11,
                "text": "leading academics is wild",
                "replies": [
                    {
                        "comment_id": "kzedrq7",
                        "author": "Chinesesingertrap",
                        "score": -1,
                        "text": "How is someone who has written books on and researched this topic for as many years as norm has not a leading academic in this topic",
                        "replies": [
                            {
                                "comment_id": "kzf5bm0",
                                "author": "An1meK1ng",
                                "score": 4,
                                "text": "Every single academic does this. That alone doesn't make u leading",
                                "replies": [
                                    {
                                        "comment_id": "kzf5u1n",
                                        "author": "Chinesesingertrap",
                                        "score": 1,
                                        "text": "Like it or not he is a leading academic on this issue and has been for many years you saying nu uh doesn't change that fact.  Sorry your leader destiny can't even point to Israel on a map let alone be able to hold up in a debate with actual academics",
                                        "replies": [
                                            {
                                                "comment_id": "kzlp5h2",
                                                "author": "An1meK1ng",
                                                "score": 1,
                                                "text": "Eh I'm certain destiny will destroy norm in geo quiz.\nWhat's the leading/novel research has he done? Pretty every serious academic has said finklestink isn't a serious historian.",
                                                "replies": [
                                                    {
                                                        "comment_id": "kzls0ki",
                                                        "author": "Chinesesingertrap",
                                                        "score": 1,
                                                        "text": "Highly doubt that Norman has studied this conflict for many years.  I would like to see any proof you have about serious academics not thinking he's a leading historian because you are wrong.  Maybe read the writing portion of his Wikipedia page and then you will have as much info on him as your leet gamer hero destiny\n\n\"Finkelstein's work has been praised by scholars such as Chomsky,[24] the political scientist Raul Hilberg, and historian Avi Shlaim,[25] and his advocates and detractors have remarked on his polemical style.[26][25]\"\n\nhttps://en.m.wikipedia.org/wiki/Norman_Finkelstein",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "comment_id": "kzhrxre",
                                "author": "fridiculou5",
                                "score": 2,
                                "text": "Finkleststien is not a highly cited historian on the matter.  Finklestien is the Dr. Oz of the Palestine.\n\nHis primary academic klout is through the evangelizing the point that Israel has leveraged the holocaust for political Zionism, which btw, is not a unique or innovation point.\nOnly problem - people like Ilan Pappe and Benny Moris have made that point before.",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kze3wis",
                "author": "GoodLeroyBrown",
                "score": 14,
                "text": "I didn't realize non academics were incapable of independent research and thoughts.",
                "replies": [
                    {
                        "comment_id": "kze6d34",
                        "author": "SoulAssassin808",
                        "score": -5,
                        "text": "They are, but that's like saying that non-NBA players can play basketball.",
                        "replies": [
                            {
                                "comment_id": "kzebwxw",
                                "author": "GoodLeroyBrown",
                                "score": 1,
                                "text": "Terrible analogy.",
                                "replies": []
                            },
                            {
                                "comment_id": "kzhhulb",
                                "author": "gotewarrior",
                                "score": 1,
                                "text": "If I went up against LeBron James, he could absolutely trounce me even if he were just using a fraction of his skills, while he's politely making small talk with me. If the analogy holds, then Finkelstein should have been able to calmly and completely obliterate Destiny's points without a single ad hominem. What you wouldn't see in the above analogy would be LeBron throwing the ball wildly and fouling over and over again, which is equivalent to how Finkelstein approached the debate.",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "kzhfysn",
                "author": "gotewarrior",
                "score": 1,
                "text": "Did you know that academics use tablets and laptops these days?",
                "replies": []
            },
            {
                "comment_id": "kze3aw5",
                "author": "PickFeisty750",
                "score": 1,
                "text": "This!",
                "replies": []
            }
        ]
    },
    {
        "comment_id": "kzmp7tz",
        "author": "Hal_Incandenza_YDAU",
        "score": 0,
        "text": "\"Destiny \\[was\\] the complete opposite.\"\n\nThe ubiquity of this view is disturbing. I have no idea how reasonable people could come to this conclusion.",
        "replies": []
    },
    {
        "comment_id": "kzugzij",
        "author": "the_dave_mann",
        "score": 0,
        "text": "I think Bari Weiss would make for a great debater for the pro-Israel side",
        "replies": []
    },
    {
        "comment_id": "kzwd2az",
        "author": "TheAlGler",
        "score": 0,
        "text": "Honestly, Bassem Youssef would have been a million times better than Finkledick in that debate.\n\nIt took Destiny 3 hours to resort to personal attacks after receiving nothing but that from Norm for the entire duration. I commend him keeping his composure as well as he did.",
        "replies": []
    },
    {
        "comment_id": "kzef3hp",
        "author": "Hungry_Prior940",
        "score": -13,
        "text": "Destiny is honestly terrible in debates. Finklestein is too arrogant and annoying even if he makes a good point. Honestly, I don't want another of these pointless debates. Move on to something better than a dull debate.",
        "replies": [
            {
                "comment_id": "kzf11a3",
                "author": "None",
                "score": 6,
                "text": "[removed]",
                "replies": [
                    {
                        "comment_id": "kzfuisd",
                        "author": "Hungry_Prior940",
                        "score": -1,
                        "text": "No, he does. Israel, being a genocidal fascist state, makes it easy, though.",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "comment_id": "kzf91tv",
        "author": "packers906",
        "score": -10,
        "text": "Finkelstein is smart but kind of insufferable and Destiny was outclassed.   Morris is a good historian who did a lot of valuable work but has taken some weird views late in life.  I don't really know the fourth guy but I felt like some of his readings of things were disingenuous (like when he claimed to have read Herzl's entire diary but then just quoted the one gotcha thing everyone quotes on the internet).   I'd like to see a completely different four.",
        "replies": []
    },
    {
        "comment_id": "kzgfvxg",
        "author": "Squaplius",
        "score": -4,
        "text": "Destiny is a joke. My man has somehow convinced Lex he is a serious person smh",
        "replies": []
    },
    {
        "comment_id": "kzg65tl",
        "author": "iq19zero",
        "score": -8,
        "text": "Would you have a debate with a serial killer?  Do you really need to listen to their point of view?  Not everything is a debate.  One side is clearly in the wrong.  Speak the hard truth.",
        "replies": [
            {
                "comment_id": "kzhr718",
                "author": "fridiculou5",
                "score": 4,
                "text": "Sounds like you're arguing that Hamas was defended.",
                "replies": []
            }
        ]
    }
]